{"name": "Ibis London Greenwich", "price": "$81", "img": "holder.js/250x250?theme=thumb", "rating": "4.0", "ratingNum": 186, "reviews": [{"user_name": "Julie Q", "user_wrote_time": "Jan 2020", "contriNum": "16 contributions", "helpfulNum": "17 helpful votes", "currentRating": "3.0", "title": "A nice spot for an overnight in Greenwich.", "content": "I chose the Ibis because of it's location to the historic spots in Greenwich and because it looked clean and modern. It did not disappoint. Check-in was easy and quick and my room was basic but comfortable. It's within easy walking distance to all the major spots to explore and it was easy to pop in and out for a bite to eat, etc. The room had all the things you need for a night and I'd recommend it if you're wanting a basic place to sleep.", "time": " November 2019", "helpful_vote": 1, "polarity": 0.477, "keywords": ["comfortable", "clean", "easy", "modern", "greenwich"], "matchKeywords": ["comfortable", "clean", "easy", "modern", "greenwich"], "categories": ["loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "racmar01", "user_wrote_time": "Jan 2020", "contriNum": "34 contributions", "helpfulNum": "25 helpful votes", "currentRating": "1.0", "title": "Rude, unwelcoming staff", "content": "Stayed her on Tuesday to attend the NTAs at London O2.  I've not stayed in a hotel where I've come across such rude staff and poor set up. On my journey down as there had been a serious accident on the m1 which caused it to be closed for nearly 2 hours. I called and advised this, as I was explaining I was rudely asked 'what is is you want!' Not a great first impression. I wanted to know if there was a luggage storage as we would now be late for the NTAs.  Upon arrival, currently 30 min late to the NTAs we arrived (we had got a uber from London Victoria that was waiting outside to take us to the O2) and wasnt sure we were in the right place. No staff were around and nothing that looked like a reception.", "time": " January 2020", "helpful_vote": 1, "polarity": -0.795, "keywords": ["tuesday", "late", "accident", "rude", "rudely"], "matchKeywords": ["late", "rude"], "categories": [], "userImg": "user-img.png"}, {"user_name": "Joanne M", "user_wrote_time": "Jan 2020", "contriNum": "18 contributions", "helpfulNum": "20 helpful votes", "currentRating": "5.0", "title": "Surprisingly Good", "content": "I booked this hotel for a surprise for a friend's birthday.  I was expecting it to be okay from reviews I had read.  It was so much better.  The staff were really friendly and helpful, went above and beyond.  The room was a standard double, oh my word the room was amazing, from a very comfy bed to the biggest TV I have ever seen, to a shower I could have moved into.  It was clean, it was quiet.  Had the best stay.  Would stay again.", "time": " January 2020", "helpful_vote": 1, "polarity": 0.39, "keywords": ["hotel", "birthday", "bed", "shower", "comfy"], "matchKeywords": ["hotel", "birthday", "bed", "shower", "comfy"], "categories": ["facility", "travelling purpose"], "userImg": "user-img.png"}, {"user_name": "Rebecca Y", "user_wrote_time": "Jan 2020", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "5.0", "title": "Great value, great location", "content": "It was an excellent stay with friendly and helpful staff. The room was clean and I never needed to ask for any service. The bed was comfortable and the hotel was quiet. Great stay, I would definitely stay again.", "time": " January 2020", "helpful_vote": 0, "polarity": 0.616, "keywords": ["comfortable", "clean", "bed", "hotel", "quiet"], "matchKeywords": ["comfortable", "clean", "bed", "hotel", "quiet"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "jonessb1", "user_wrote_time": "Jan 2020", "contriNum": "649 contributions", "helpfulNum": "142 helpful votes", "currentRating": "2.0", "title": "Disappointing this time", "content": "This was my second visit to this hotel and on this occasion I'm writing an additional review as I found the hotel disappointing in comparison to my earlier visit. On the plus side, the staff are welcoming and very helpful. The breakfast, an extra cost, in the attached Cafe Rouge is also quite good. However, the room was small and I don't recall ever staying in a hotel room with only one towel per guest. We stayed for three nights and this was the case on each night. Furthermore, our room overlooked a busy street and it was quite noisy at night. Overall, I didn't feel that it was value-for-money.", "time": " January 2020", "helpful_vote": 1, "polarity": -0.297, "keywords": ["breakfast", "cafe", "night", "nights", "hotel"], "matchKeywords": ["breakfast", "cafe", "hotel"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "LK_MBE", "user_wrote_time": "Jan 2020", "contriNum": "1,073 contributions", "helpfulNum": "146 helpful votes", "currentRating": "3.0", "title": "OKAY ", "content": "Stayed for one night, it was windy and cold outside, had a quiet room overlooking the car park, so no road noise. The room was very clean and comfortable apart from the hard chair and floor. Dinner and Breakfast were taken in the adjoining Cafe Rouge,  my meals were ok, but my colleague had problems with hers. Freindly staff on reception. This hotel was a reasonable price for London and perfectly sited to explore Greenwich.", "time": " January 2020", "helpful_vote": 0, "polarity": 0.012, "keywords": ["dinner", "cafe", "hotel", "breakfast", "meals"], "matchKeywords": ["dinner", "cafe", "hotel", "breakfast", "meals"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "TravellerOxford", "user_wrote_time": "Jan 2020", "contriNum": "584 contributions", "helpfulNum": "118 helpful votes", "currentRating": "4.0", "title": "Great Location for Greenwich Attractions, Good VFM", "content": "THE GOOD Birthday Trip - exceeded expectations with small cake, Prosecco, balloons and handwritten card in the room. Central location within walking distance of all Greenwich attractions. Very friendly welcome; everything explained well. Good little reception/waiting area. Security good as you needed your key card to use the lift or walk up stairs. Great VFM. Window opens in the room - hurrah. Parking available, if you arrive early enough, right next door for GBP15 for 24hrs and £3.00 per hour afterwards. Tea, coffee and hairdryer in room.  THE BAD Breakfast - very disappointing at Cafe Rouge. Cold, Tomatoes not cooked, no brown bread - white stale.", "time": " January 2020", "helpful_vote": 0, "polarity": 0.219, "keywords": ["cake", "tea", "breakfast", "birthday", "sweetroom"], "matchKeywords": ["tea", "breakfast", "birthday"], "categories": ["food", "travelling purpose"], "userImg": "user-img.png"}, {"user_name": "SnaxMuppet", "user_wrote_time": "Dec 2019", "contriNum": "212 contributions", "helpfulNum": "141 helpful votes", "currentRating": "2.0", "title": "Not a great experience", "content": "I stayed here with my wife for 2 night in December 2019.  Check-in was fine but the reception staff were not very friendly. After collecting the key-card we tried to enter the lift but it needs the card to enter and it didn't work. The desk clerk helped by pushing the card in and out really quickly many times... eventually it let us in.  The room was small and had we been staying longer than just a couple of nights then we would have struggled to store everything. There were no drawers and no hooks on the wall for coats. The room itself was modern and in pretty good condition except for the carpet which had unpleasant-looking stains outside the bathroom. There was an electric socket cube with USB charging which was nice.", "time": " December 2019", "helpful_vote": 0, "polarity": -0.519, "keywords": ["wife", "bathroom", "december", "clerk", "carpet"], "matchKeywords": ["wife", "bathroom", "carpet"], "categories": ["facility", "companion"], "userImg": "user-img.png"}, {"user_name": "Simon H", "user_wrote_time": "Dec 2019", "contriNum": "27 contributions", "helpfulNum": "13 helpful votes", "currentRating": "4.0", "title": "Good hotel, if your key card works", "content": "I have a few basic requirements of a budget hotel, most of which this hotel satisfies. Nice clean rooms, tick. good hot shower, tick. kettle and tea making facilities, tick, comfy bed and pillows, tick, ability to open window for fresh air, tick. I'm not really bothered about overly friendly staff, just for them to be quick and efficient if you have a problem, which this hotel staff were. The only big fat fly in the ointment was the constant filure of my keycard to start the lift and open my room door. I had to have my key changed three times because it kept failing, and it is really annoying to walk up two flights of stairs to discover you can't get in your room and then have to walk back down to reception for a new card three (yes three) times in total.", "time": " December 2019", "helpful_vote": 1, "polarity": 0.037, "keywords": ["shower", "tea", "hotel", "bed", "pillows"], "matchKeywords": ["shower", "tea", "hotel", "bed", "pillows"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Michael L", "user_wrote_time": "Nov 2019", "contriNum": "89 contributions", "helpfulNum": "27 helpful votes", "currentRating": "3.0", "title": "Room good, staff very friendly but average hot breakfast", "content": "The staff are very welcoming and the room was clean and spacious.  However on ordering a cook breakfast I was disappointed with the extremely fatty bacon and I was not sure that it was toast or fried bread that accompanied the breakfast.  I presumed it was toast as it had a pack of butter on the side.  The orange juice was warm and this added to my disappointment with the breakfast experience.", "time": " November 2019", "helpful_vote": 0, "polarity": -0.557, "keywords": ["bacon", "breakfast", "butter", "bread", "cook"], "matchKeywords": ["bacon", "breakfast", "bread"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "Sara J", "user_wrote_time": "Nov 2019", "contriNum": "2 contributions", "helpfulNum": "2 helpful votes", "currentRating": "3.0", "title": "Well located", "content": "We stayed for two nights over a weekend.  The hotel is well situated and the staff are warm and welcoming.  The room had an opening window ( Hurrah!).   But... the loo can't be used comfortably by anyone over 5' 8\".  I ended up sitting sideways.  Breakfast was run by Cafe Rouge who don't have good customer service.  We waited a long time to be served and were given food that had clearly been cooked some time earlier and left under a heater.", "time": " November 2019", "helpful_vote": 2, "polarity": -0.178, "keywords": ["breakfast", "cafe", "cooked", "weekend", "hotel"], "matchKeywords": ["breakfast", "cafe", "cooked", "weekend", "hotel"], "categories": ["food", "travelling purpose", "facility"], "userImg": "user-img.png"}, {"user_name": "Newinnman", "user_wrote_time": "Oct 2019", "contriNum": "560 contributions", "helpfulNum": "324 helpful votes", "currentRating": "4.0", "title": "My new goto hotel in the east of London", "content": "Really impressed with this hotel.  Modern rooms, excellent location for the Cutty Sark, Greenwich Observatory and the DLR to Canary Wharf.  Basically this hotel is located in the heart of Greenwich.  Our room had a small TV and a/c, and didn’t cost the earth either.  The room faced the main road, didn’t notice any noise.  Downstairs there’s a good french -chain-restaurant attached.  The hotel also offers on-site parking at £15 for 24 hours, which is really unusual for hotels in this area of London.  A great find, helpful staff, nicely located.", "time": " August 2019", "helpful_vote": 2, "polarity": 0.27, "keywords": ["hotel", "restaurant", "hotels", "london", "modern"], "matchKeywords": ["hotel", "restaurant", "hotels", "london", "modern"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "TheFussyTeenager", "user_wrote_time": "Oct 2019", "contriNum": "324 contributions", "helpfulNum": "113 helpful votes", "currentRating": "4.0", "title": "Pleasant Stay 💤", "content": "This hotel is in a nice area: I felt pretty safe when walking to it at night.  Although the location was convenient location for me, there didn't seem to be much around. That being said, it's about a ten minute train journey from London Bridge station, so getting into more central London from here is easy.  The staff were welcoming enough and my room was presentable: I made the most of having the big, wide double bed all to myself!  The en suite was clean with a strong, hot shower.  Everything felt 4-Star good. I wasn't totally blown away by my experience, but the stay was altogether pleasant.", "time": " October 2019", "helpful_vote": 0, "polarity": 0.418, "keywords": ["hotel", "shower", "hot", "bed", "london"], "matchKeywords": ["hotel", "shower", "hot", "bed", "london"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Jenny P", "user_wrote_time": "Oct 2019", "contriNum": "3 contributions", "helpfulNum": "1 helpful vote", "currentRating": "5.0", "title": "Fantastic Service all round!", "content": "So my daughter and i stayed here for the night as i was taking her to the O2 to see Ariana Grande.  When booking i told the hotel this but had actually forgotten all about it until we arrived at the Ibis where she was made to feel really special when we arrived by calling her by her name and wishing her a very happy birthday. When we got to our room we were even more surprised to find a birthday card, chocolate cake and strawberries, and a wonderful Ariana Themed birthday framed poster which the Ibis team had created. \"This is the best day of my life\" my daughter exclaimed and that was even before the concert. I would like to thank Raluca and her team for going the extra mile and believing that the little things matter. we both felt really special.", "time": " October 2019", "helpful_vote": 1, "polarity": 0.483, "keywords": ["birthday", "strawberries", "cake", "daughter", "chocolate"], "matchKeywords": ["birthday", "daughter", "chocolate"], "categories": ["travelling purpose", "companion", "food"], "userImg": "user-img.png"}, {"user_name": "Robin H", "user_wrote_time": "Oct 2019", "contriNum": "223 contributions", "helpfulNum": "78 helpful votes", "currentRating": "2.0", "title": "Barely Worth The Money", "content": "Friends recommended this hotel after staying here before but even they found standards had slipped.  We found the staff unwelcoming and rude.  The room was tiny with no closet space to speak of.  The bathroom was microscopic. No hand towels and no face cloths. Its not really convenient to anything but there are some decent pubs and restaurant in the area. Most stop selling food quite early though. We wouldn't stay here again.", "time": " September 2019", "helpful_vote": 0, "polarity": -0.874, "keywords": ["restaurant", "unwelcoming", "rude", "bathroom", "closet"], "matchKeywords": ["restaurant", "rude", "bathroom", "closet"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "recneps40", "user_wrote_time": "Oct 2019", "contriNum": "13 contributions", "helpfulNum": "6 helpful votes", "currentRating": "5.0", "title": "Family Visit in Greenwich", "content": "My wife and I stayed here for 4 nights last week.   Great location, very clean rooms and great value for money in this part of London.   the Reception staff were most helpful and could cope with the vast range of overseas guests.  However, an extra hand towel would be appreciated.", "time": " October 2019", "helpful_vote": 1, "polarity": 0.095, "keywords": ["wife", "guests", "nights", "helpful", "london"], "matchKeywords": ["wife", "guests", "helpful", "london"], "categories": ["companion", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "ColemanWood", "user_wrote_time": "Oct 2019", "contriNum": "51 contributions", "helpfulNum": "53 helpful votes", "currentRating": "4.0", "title": "Good location for Canary Wharf", "content": "Used this hotel when attending a conference at Canary Wharf. It’s just a few stops on the DLR and a very short walk at either end.  The hotel is basic but clean and the staff are friendly. Breakfast is taken in the Cafe Rouge downstairs.", "time": " October 2019", "helpful_vote": 1, "polarity": -0.218, "keywords": ["cafe", "breakfast", "hotel", "clean", "downstairs"], "matchKeywords": ["cafe", "breakfast", "hotel", "clean"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Chris W", "user_wrote_time": "Oct 2019", "contriNum": "174 contributions", "helpfulNum": "55 helpful votes", "currentRating": "5.0", "title": "Surprisingly good!", "content": "The interior of the hotel is very different to what one expects on seeing the exterior. It is modern and slightly funky. Young reception staff are helpful and welcoming. The room was not big, but adequate. King size bed, firm but comfortable, with fresh clean linen.  The bathroom was again not big, but a good shower with a large dispenser with multi purpose liquid soap, apparently suitable for face, hands, body and hair - good idea, does away with those little plastic tubes. Only one smallish bath towel per person and one shower mat, would have liked a separate hand towel, but fresh towels are supplied daily if you need them.  Tea and coffee making supplies in the room, but rather scant in number.  The room had heating and aircon, and a window that opened.", "time": " October 2019", "helpful_vote": 0, "polarity": 0.237, "keywords": ["bathroom", "towels", "shower", "soap", "bath"], "matchKeywords": ["bathroom", "towels", "shower", "soap", "bath"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Jessica R", "user_wrote_time": "Oct 2019", "contriNum": "2 contributions", "helpfulNum": "1 helpful vote", "currentRating": "4.0", "title": "Friendly and welcoming", "content": "Stayed here and have had no complaints. Super friendly staff who always greeted you when you leave and then return in the afternoon or night. Nice location. Clean and tidy room. The food was quite good and it had a really good atmosphere.", "time": " August 2019", "helpful_vote": 1, "polarity": 0.716, "keywords": ["clean", "friendly", "tidy", "food", "nice"], "matchKeywords": ["clean", "friendly", "tidy", "food", "nice"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "Peter", "user_wrote_time": "Sep 2019", "contriNum": "31 contributions", "helpfulNum": "22 helpful votes", "currentRating": "5.0", "title": "Surprise", "content": "After staying in hyped up London hotels over the years what a great surprise to stay in a clean, comfortable and well thought out hotel room. Staff beyond reproach from the rooms maids to reception all willing to make our stay enjoyable with no dramas. I did ask about the incident I read about recently and felt very happy with the response of the measures in place. Thanks to all the team, see you on our next visit.", "time": " September 2019", "helpful_vote": 0, "polarity": 0.969, "keywords": ["hotel", "maids", "hotels", "hyped", "happy"], "matchKeywords": ["hotel", "hotels", "happy"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Seaview5", "user_wrote_time": "Sep 2019", "contriNum": "747 contributions", "helpfulNum": "149 helpful votes", "currentRating": "3.0", "title": "Good location", "content": "When we arrived we received the usual Ibis friendly welcome. Our room was of the usual Ibis standard – very clean and with a sensible semi-open wardrobe combination where we could store our suitcases. We requested extra towels which was not a problem. There were comfortable seats in Reception but the carpets in the corridor were badly stained, looked dirty and obviously needed to be replaced.", "time": " September 2019", "helpful_vote": 0, "polarity": 0.076, "keywords": ["towels", "carpets", "wardrobe", "clean", "suitcases"], "matchKeywords": ["towels", "carpets", "clean"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Alix_001", "user_wrote_time": "Sep 2019", "contriNum": "3 contributions", "helpfulNum": "3 helpful votes", "currentRating": "5.0", "title": "Ibis Greenwich", "content": "Lovely comfy room and super clean. Staff were friendly and helpful. Parking was good value and right next to the hotel.  The location was very good for the east end with train stations nearby and attractions very close by too. Will definitely stay again.", "time": " September 2019", "helpful_vote": 1, "polarity": 0.995, "keywords": ["comfy", "helpful", "friendly", "clean", "hotel"], "matchKeywords": ["comfy", "helpful", "friendly", "clean", "hotel"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Chris J", "user_wrote_time": "Sep 2019", "contriNum": "180 contributions", "helpfulNum": "51 helpful votes", "currentRating": "2.0", "title": "Good location but hotel facilities were disappointing", "content": "I stayed four days at the Ibis in Greenwich. The hotel has been here for a few years and is showing its age.  The location is very good and car parking available for a reasonable charge.  The staff were helpful and enthusiastic but the room was spartan and cold.  The air con only blew cold air.  The room was clean and the bed comfortable but the bathroom was very dated.  At £100 a night the Ibis Greenwich is a fair proposition.  At £223 a night (which I paid) it was poor value.", "time": " September 2019", "helpful_vote": 1, "polarity": -0.445, "keywords": ["hotel", "night", "spartan", "cold", "bathroom"], "matchKeywords": ["hotel", "cold", "bathroom"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Redjms", "user_wrote_time": "Sep 2019", "contriNum": "29 contributions", "helpfulNum": "27 helpful votes", "currentRating": "2.0", "title": "Serious breach of security ", "content": "I hate to write a negative review for this hotel as we initially really enjoyed our stay. The hotel is in a great location, clean & comfortable. Its compact but that didn't bother us. We ate breakfast in surrounding cafes which were a delight. However, on our last night while we were sleeping, someone entered our room. They quickly left when we started shouting. We had also used the manual lock prior to going to bed which obviously didn't work.The only contact for reception is by using WhatsApp! They replied to our frightened message by blocking all cards including our own to the room & stated they were monitoring it on the CCTV.  It ruined our last night, we couldn't sleep, so in turn it ruined our final morning as we just wanted to get home.", "time": " September 2019", "helpful_vote": 1, "polarity": -0.223, "keywords": ["breakfast", "sleep", "bed", "sleeping", "hotel"], "matchKeywords": ["breakfast", "sleep", "bed", "sleeping", "hotel"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Flyer252037", "user_wrote_time": "Sep 2019", "contriNum": "2 contributions", "helpfulNum": "0", "currentRating": "5.0", "title": "Overnight in Greenwich", "content": "Looking for an overnight stay in Greenwich we didn't previously know any of the hotels so picked this because of its location. So we were very pleased to find we had made a great choice.  Perfectly sited to see all the local attractions, very close to bus stops and DLR station and surrounded by options for food and drink besides Cafe Rouge which was linked to the hotel.  Our room was great.  Bed was large and comfortable.  A lovely, powerful shower in the bathroom and tea and coffee in the room. The room had controls for heating but we didn't use them.  Windows that opened to let fresh air in but also great at keeping out noise when they were shut because we didn't hear a sound.  Also very effective black out curtains that kept out any street light.", "time": " August 2019", "helpful_vote": 0, "polarity": 0.448, "keywords": ["tea", "shower", "bathroom", "hotel", "bed"], "matchKeywords": ["tea", "shower", "bathroom", "hotel", "bed"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "JLW14", "user_wrote_time": "Aug 2019", "contriNum": "56 contributions", "helpfulNum": "27 helpful votes", "currentRating": "4.0", "title": "Good place to stay in London.", "content": "I was pleasantly surprised by the Ibis at Greenwich. It was clean, comfortable, quiet and well located in terms of transport to the tourist centre of London.  My room was a standard double - queen bed, desk, chair, tv with cable, small bathroom, tea and coffee making facilities. It was a good size, with an opening window if you didn’t want to use the air conditioning (I did use it as it was quite hot for my stay and the in-room air conditioner was quiet and effective). I loved the floating timber floors as I knew they were clean.   The carpet in the hallways is a bit grubby, but I believe this is on the list in their refurbishment plans.", "time": " August 2019", "helpful_vote": 0, "polarity": 0.488, "keywords": ["tea", "carpet", "bed", "comfortable", "bathroom"], "matchKeywords": ["tea", "carpet", "bed", "comfortable", "bathroom"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Gary A", "user_wrote_time": "Aug 2019", "contriNum": "32 contributions", "helpfulNum": "14 helpful votes", "currentRating": "5.0", "title": "Excellent budget hotel", "content": "For a budget hotel it is ideally located with close access to transport links. Staff are friendly and accommodating. The hotel is clean and rooms are fine. Would happily stay again in the future.Thank you.", "time": " August 2019", "helpful_vote": 0, "polarity": 0.785, "keywords": ["hotel", "clean", "friendly", "accommodating", "happily"], "matchKeywords": ["hotel", "clean", "friendly", "accommodating", "happily"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "735abdelkaders", "user_wrote_time": "Aug 2019", "contriNum": "5 contributions", "helpfulNum": "1 helpful vote", "currentRating": "5.0", "title": "Room for Improvement.", "content": "I would definitely recommend this Hotel as it is situated in a very good area close to the Pier and train station. Cutty Sark is about 5 mns walk the hotel in general very clean and the room is comfortable and the right size. However, The Breakfast is a let down as it is a basic French Style`s breakfast  and not even in the Hotel itself like every other Ibis Hotels I stayed in but in Cafe Rouge which is adjoined to the hotel and not much choice in the Menu.", "time": " August 2019", "helpful_vote": 0, "polarity": 0.324, "keywords": ["cafe", "breakfast", "menu", "hotel", "hotels"], "matchKeywords": ["cafe", "breakfast", "menu", "hotel", "hotels"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Socialtraveller_13", "user_wrote_time": "Aug 2019", "contriNum": "2 contributions", "helpfulNum": "3 helpful votes", "currentRating": "5.0", "title": "Excellent staff and location", "content": "Check in staff were lovely, professional and helpful.  Room was spotless and perfectly adequate.  Location is brilliant for Greenwich pier, the Cutty Sark and the Observatory which are all well worth a visit.  Highly recommended hotel.", "time": " July 2019", "helpful_vote": 0, "polarity": 0.988, "keywords": ["hotel", "perfectly", "helpful", "professional", "adequate"], "matchKeywords": ["hotel", "perfectly", "helpful", "professional"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "J M", "user_wrote_time": "Jul 2019", "contriNum": "5 contributions", "helpfulNum": "4 helpful votes", "currentRating": "5.0", "title": "Good and friendly hotel", "content": "I have stayed several times when moving my student children in and out of student accommodation. Very convenient, with parking and quiet nice rooms. Wasn't that impressed with the restaurant, but there were good places to eat nearby.", "time": " September 2018", "helpful_vote": 1, "polarity": -0.14, "keywords": ["restaurant", "eat", "student", "accommodation", "nearby"], "matchKeywords": ["restaurant", "eat"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Renay17", "user_wrote_time": "Jul 2019", "contriNum": "37 contributions", "helpfulNum": "24 helpful votes", "currentRating": "2.0", "title": "It’s a no from me .. 👎🏼", "content": "We stayed for three nights at the Ibis in Greenwich. On arrival we were greeted by a loud ‘front reception’ worker who proceeded to check us in on her mobile phone... it took a while. Then she proceeded to ask for our credit card and asked for payment in full when we had already paid. After that it was the hard sell on breakfast which I had already done my homework - based on the reviews we were happy not to have breakfast at the hotel. Our check in experience was not very pleasant.  We had asked for a quiet room only to be placed on the first floor facing a busy road. The air conditioner.. or air cooler 😂 as they called it was non existent. Their suggestion was to open the window to cool the room down. Ok, open the window and hear the constant traffic noise .. no thanks.", "time": " July 2019", "helpful_vote": 1, "polarity": -0.704, "keywords": ["breakfast", "homework", "traffic", "hotel", "nights"], "matchKeywords": ["breakfast", "traffic", "hotel"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Linda And Lloyd S", "user_wrote_time": "Jul 2019", "contriNum": "15 contributions", "helpfulNum": "26 helpful votes", "currentRating": "4.0", "title": "Excellent Service, But No AIR CONDITIONING And It's Needed!", "content": "This is a difficult review to write. The hotel was nice, modern decor, the rooms are fairly spacious for London budget and in very good shape and clean, and the service was EXCELLENT! However, when we reserved our room, a double for two, their website stated room a/c. However, we  found out before we went (on a changed website), that it was only a room cooling system controlled by the hotel. Having stayed in places with this kind of cooling system, that translates to no cooling. I contacted the hotel when I found out about it, which was 16 days before we left, and they contacted me a full week later. They did apologize, explained about the error, said they could offer us fans, but also offered a refund.", "time": " May 2019", "helpful_vote": 1, "polarity": -0.56, "keywords": ["hotel", "london", "modern", "website", "rooms"], "matchKeywords": ["hotel", "london", "modern", "rooms"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Sue C", "user_wrote_time": "Jul 2019", "contriNum": "144 contributions", "helpfulNum": "50 helpful votes", "currentRating": "3.0", "title": "No frills simple hotel", "content": "This hotel is perfectly located in the centre of Greenwich making it an ideal place to explore the area. Our room was basic and clean with a view over the air-conditioning units. Tea n coffee are provided but we did need to ask for more teabags as they only provided x2! My pillow was rock hard but i didnt get round to asking for a softer version so i cant comment on whether they'd accommodate my needs. Ladies... Be warned that the hairdryer is very weak. It took me ages to dry my hair which i found very frustrating! Breakfast is in the Cafe Rouge attached to the hotel. A bit pricey at £9.25 but the food was good, although im sure we could have found a cheaper version somewhere in town. All in all, a simple no frills hotel that did the job.", "time": " July 2019", "helpful_vote": 2, "polarity": -0.165, "keywords": ["tea", "teabags", "breakfast", "coffee", "hairdryer"], "matchKeywords": ["tea", "breakfast", "coffee", "hairdryer"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Somepeople291", "user_wrote_time": "Jul 2019", "contriNum": "44 contributions", "helpfulNum": "7 helpful votes", "currentRating": "4.0", "title": "Nice hotel, comfy room but no air con", "content": "I stayed in the ibis with friends while attending a concert at the Old Naval College. It’s perfectly located in Greenwich. The room was clean and comfortable, we had to ask for extra towels (just one small hand towel each was provided initially). Being July it was also very warm, although the unit in the ceiling looks like air con, it isn’t. It was unbearably hot. Check in was easy and the staff welcoming. After the concert the bar was busy, as you’d expect, but they hadn’t taken this into consideration and ran out of glasses, and there wasn’t enough staff on. It took 15-20mins just to get a drink. That said, I would stay here again.", "time": " July 2019", "helpful_vote": 0, "polarity": 0.061, "keywords": ["concert", "july", "towels", "warm", "hot"], "matchKeywords": ["concert", "towels", "warm", "hot"], "categories": ["loation & surroundings", "facility"], "userImg": "user-img.png"}, {"user_name": "John S", "user_wrote_time": "Jul 2019", "contriNum": "503 contributions", "helpfulNum": "122 helpful votes", "currentRating": "4.0", "title": "70th Birthday trip", "content": "Two night stay with friends for my 70th birthday. Staff had put a birthday card, prosecco, glasses and trimmings  in our room, Nice touch. Small room but clean and functional. Small bathroom with cramped toilet area. No toilet brush. Extractor fan inefficient. Bar prices expensive. Parking £15 per day. Breakfast not brilliant  provided at Cafe Rouge adjoining hotel. Great position for all Greenw9 attractions.", "time": " July 2019", "helpful_vote": 1, "polarity": 0.113, "keywords": ["breakfast", "birthday", "hotel", "cafe", "bathroom"], "matchKeywords": ["breakfast", "birthday", "hotel", "cafe", "bathroom"], "categories": ["food", "facility", "travelling purpose"], "userImg": "user-img.png"}, {"user_name": "jonessb1", "user_wrote_time": "Jul 2019", "contriNum": "649 contributions", "helpfulNum": "142 helpful votes", "currentRating": "4.0", "title": "Pleasant hotel in the heart of Greenwich", "content": "This hotel is located in the heart of Greenwich, close to all the major attractions. The hotel is modern, clean and comfortable - typical of this chain of hotels. At this hotel breakfast is served in the adjoining Cafe Rouge, where there is a good choice from the menu. The prices are reasonable for London and the staff are friendly and helpful.", "time": " July 2019", "helpful_vote": 0, "polarity": 0.972, "keywords": ["hotel", "cafe", "breakfast", "hotels", "london"], "matchKeywords": ["hotel", "cafe", "breakfast", "hotels", "london"], "categories": ["food", "facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "edocarrara", "user_wrote_time": "Jul 2019", "contriNum": "91 contributions", "helpfulNum": "42 helpful votes", "currentRating": "5.0", "title": "Nice hotel in greenwhich", "content": "The hotel as a perfect position very close to cutty sark and greenwhich observatory. London center is reachable in twenty minuts by DLR and Jubilee line. Great very good breakfast at rouge bar. Rooms well cleaned.", "time": " June 2019", "helpful_vote": 1, "polarity": 0.709, "keywords": ["breakfast", "hotel", "perfect", "cleaned", "london"], "matchKeywords": ["breakfast", "hotel", "perfect", "cleaned", "london"], "categories": ["food", "facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "The Roaming Homebody", "user_wrote_time": "Jul 2019", "contriNum": "84 contributions", "helpfulNum": "27 helpful votes", "currentRating": "4.0", "title": "Ticks all boxes of what you’d expect from Ibis", "content": "Decent, clean room with a very comfortable bed and good shower at an enviable rate (for London). This branch of Ibis delivers on what you’d expect of the chain and has been a reliable base for me when in London. Personally, I like the Greenwich area, especially in the more sunny months and I’m not put off from taking a bit longer (and using the DLR) to get to the London hotspots, but it may be an issue for some people. Never had breakfast at the hotel as the neighbourhood offers plenty of nice alternatives.  One side-note: the newly renovated rooms no longer have a phone. Instead, you’re supposed to WhatsApp reception if you need any assistance. I understand where they are coming from, but this struck me as a hindrance for a lot of guests.", "time": " June 2019", "helpful_vote": 1, "polarity": -0.082, "keywords": ["shower", "sunny", "breakfast", "hotel", "bed"], "matchKeywords": ["shower", "breakfast", "hotel", "bed"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "douglasf01", "user_wrote_time": "Jun 2019", "contriNum": "2 contributions", "helpfulNum": "0", "currentRating": "4.0", "title": "ibis greenwich", "content": "You get what you expect from an ibis hotel - clean room reasonable service breakfast at this location is in Cafe Rouge next door.", "time": " June 2019", "helpful_vote": 0, "polarity": 0.007, "keywords": ["breakfast", "cafe", "hotel", "amenities", "clean"], "matchKeywords": ["breakfast", "cafe", "hotel", "amenities", "clean"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "John S", "user_wrote_time": "Jun 2019", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "3.0", "title": "Functional hotel", "content": "Hotel served its purpose, it was clean, staff were very pleasant and helpful and it looked good from the outside. Inside the place lacks any sort of character. A few drawings of clocks in the public areas and that’s about that. The rooms are London sized, small but efficiently laid out. Shower was very good and the housekeeping staff kept it spotless. The restaurant was understaffed. At our first of four breakfasts the coffee and apple juice was at the same temperature. Apart from that the food was very good. I’d recommend the eggs benedict. The room was very quiet, so much so that we could sleep with the window open. The window was open because the air conditioning was poor.", "time": " June 2019", "helpful_vote": 0, "polarity": -0.022, "keywords": ["breakfasts", "restaurant", "coffee", "housekeeping", "apple"], "matchKeywords": ["breakfasts", "restaurant", "coffee", "housekeeping"], "categories": ["food", "facility", "service"], "userImg": "user-img.png"}, {"user_name": "Yuki", "user_wrote_time": "Jun 2019", "contriNum": "1,408 contributions", "helpfulNum": "238 helpful votes", "currentRating": "4.0", "title": "Comfortable and clean ", "content": "Very comfortable beds, clean and the rooms are pretty spacious with a TV, hairdryer, soup, kettle with tea and coffee, and an iron provided. The reception has a nice lounge area with two computers to use, a bar serving cocktails and gin, and free water. There’s also free wifi. The hotel is very clean and they have laundry available. The nearest station Cutty Sark is a 5 min walk away, and the hotel is beside greenwich market and Cafe Rouge where breakfast is served.   Breakfast is not served by Ibis: when you pay for breakfast it just gets you vouchers for cafe rouge, which allows you to pick one thing to order off the menu. It’s sit down and order, and the food is terrible and service is extremely slow, so I would not recommend breakfast there.", "time": " June 2019", "helpful_vote": 0, "polarity": -0.028, "keywords": ["tea", "cafe", "wifi", "breakfast", "cocktails"], "matchKeywords": ["tea", "cafe", "wifi", "breakfast", "cocktails"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Frivvie", "user_wrote_time": "Jun 2019", "contriNum": "56 contributions", "helpfulNum": "59 helpful votes", "currentRating": "2.0", "title": "Cramped, noisy, basic, adequate. Don’t eat in the restaurant ", "content": "I work in Greenwich a couple of times a month. I normally stay at the Premier Inn but decided to try the Ibis instead.   THE GOOD: Good central location for the tourist sites. Just 3 minutes walk from Cutty Sark DLR. Clean and tidy.   THE BAD: The receptionists could not work out how to book me in because it was a 4 room block booking and they didn’t know how to book just 1 person in. It took 30 minutes and a call to the manager to sort it.   The Ibis is like Lilliput. It’s basically the Premier Inn in miniature. The one lift was tiny, 3 persons max. The room was half the size of Premier Inn. The hanging rail was a foot long. There were no drawers, just one tiny shelf to store clothes. The TV was half the size of a Premier Inn TV. There was no bin in the room.", "time": " June 2019", "helpful_vote": 0, "polarity": -0.325, "keywords": ["receptionists", "manager", "month", "bathroom", "tourist"], "matchKeywords": ["receptionists", "manager", "bathroom", "tourist"], "categories": ["service", "facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "DREW C", "user_wrote_time": "Jun 2019", "contriNum": "47 contributions", "helpfulNum": "41 helpful votes", "currentRating": "5.0", "title": "Spartan but Clean Comfortable Room, Great Location", "content": "Pros:  - Basic room was very clean, even around the edges and under the bed. Wood floor that I prefer instead of carpeting. Not as much shelf space as other Ibis's, but enough to get by.  - Large, comfortable bed with firm mattress and pillows for a good night's sleep. - Fantastic Location - Located smack in the middle of bustling Greenwich. Plenty of shops and restaurants, supermarket, dollar store, DLR train station to the city, Cutty Sark and Thames ferry just down the road. - Laundromat is a short bus ride away. 4 pounds for a regular size wash. - Good quality HDTV with a decent selection of cable TV channels. Several in Italian, French, Arabic and German.", "time": " June 2019", "helpful_vote": 0, "polarity": 0.455, "keywords": ["mattress", "carpeting", "bed", "hdtv", "pillows"], "matchKeywords": ["mattress", "bed", "pillows"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "HPurchase24", "user_wrote_time": "Jun 2019", "contriNum": "61 contributions", "helpfulNum": "42 helpful votes", "currentRating": "5.0", "title": "Just right!", "content": "We booked here so that we could see a concert at the O2. We drove up and the parking facility was really handy.   It’s s but far to walk to the O2 but it’s location is great. Right around the corner from everything.   I would recommend find breakfast elsewhere as we didn’t enjoy the Cafe Rouge adjoined to the hotel. My breakfast was over cooked and took a long time to come out.   The staff here were all really friendly and helpful.", "time": " May 2019", "helpful_vote": 1, "polarity": 0.197, "keywords": ["breakfast", "concert", "cafe", "hotel", "cooked"], "matchKeywords": ["breakfast", "concert", "cafe", "hotel", "cooked"], "categories": ["food", "loation & surroundings", "facility"], "userImg": "user-img.png"}, {"user_name": "James M", "user_wrote_time": "Jun 2019", "contriNum": "40 contributions", "helpfulNum": "15 helpful votes", "currentRating": "3.0", "title": "It's ok for the price!", "content": "I left it rather late to arrange hotel accommodation for the evening we were visiting the O2. The Ibis still had a room available and we had no problems. The room was pretty small but adequate and the bed was quite comfy! I thought it might be noisy at night but their double or triple glazing really works well. Breakfast in the adjoining Café Rouge was ok too.", "time": " June 2019", "helpful_vote": 0, "polarity": -0.078, "keywords": ["breakfast", "café", "hotel", "evening", "late"], "matchKeywords": ["breakfast", "café", "hotel", "late"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "DRMTJ", "user_wrote_time": "Jun 2019", "contriNum": "303 contributions", "helpfulNum": "278 helpful votes", "currentRating": "4.0", "title": "Good budget hotel", "content": "Stayed for one night but would have been happy to stay longer. We were given a disabled room (not requested) this was very spacious with a large wet room. Room was clean and had kettle with tea/coffee so adequate for short stay. Didn’t eat here so can’t comment on food. Great location.", "time": " June 2019", "helpful_vote": 0, "polarity": -0.199, "keywords": ["tea", "coffee", "kettle", "night", "eat"], "matchKeywords": ["tea", "coffee", "kettle", "eat"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "momtrips", "user_wrote_time": "Jun 2019", "contriNum": "132 contributions", "helpfulNum": "59 helpful votes", "currentRating": "5.0", "title": "Different perspective traveling with family but I still recommend this place", "content": "I chose the Ibis based on my previous two visits which were very good experiences.  This time, I was traveling with family, and shared a room with a family member.   We were booked in a different type of room than I had been in previously.   The room was a little close for comfort for two adults.  (It's possible they have a bigger room available for two which I can book next time.)  The shower area was configured a bit oddly in that one has to step up to shower, and within the shower pan there are two levels and no grab bar.  Also, the toilet is very close to the wall to the point where an average sized person wouldn't have sufficient room to sit forward.  Sounds like TMI I guess, but comfort is important when traveling.  Also, lighting in the bathroom was moderately dim.", "time": " May 2019", "helpful_vote": 1, "polarity": -0.012, "keywords": ["bathroom", "shower", "toilet", "booked", "bar"], "matchKeywords": ["bathroom", "shower", "toilet", "booked", "bar"], "categories": ["facility", "service"], "userImg": "user-img.png"}, {"user_name": "Tammy F", "user_wrote_time": "Jun 2019", "contriNum": "30 contributions", "helpfulNum": "9 helpful votes", "currentRating": "3.0", "title": "Basic, but not bad ", "content": "We booked this hotel as we were going to a show at the O2 and wanted somewhere nearby. The hotel room is small and basic, but all you need to use as a base. In our hotel room the air-con wasn’t working, so we spoke to hotel staff who gave us a fan to use. The beds were basic, thin mattress and the bathroom was small too. The hotel is perfectly situated for sightseeing Greenwich, such as the observatory and maritime museum and to the O2. There is a bus, no.188 that stops at North Greenwich, which is literally outside the O2. (You can catch the bus to the O2 outside the maritime museum). The bus is a daily 24hr service, so no need to worry about using the underground after the show (I wouldn’t recommend using after the show, as it’s rammed).", "time": " June 2019", "helpful_vote": 0, "polarity": -0.44, "keywords": ["hotel", "bathroom", "mattress", "museum", "sightseeing"], "matchKeywords": ["hotel", "bathroom", "mattress", "sightseeing"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Lel1960", "user_wrote_time": "Jun 2019", "contriNum": "78 contributions", "helpfulNum": "12 helpful votes", "currentRating": "4.0", "title": "Great location", "content": "Good location in Greenwich, walkable to museums, Cutty Sark and markets. Nice comfy beds, helpful staff. Has a Cafe Rouge restaurant on the ground floor but lots of other options close by.", "time": " May 2019", "helpful_vote": 1, "polarity": 0.512, "keywords": ["cafe", "restaurant", "comfy", "walkable", "helpful"], "matchKeywords": ["cafe", "restaurant", "comfy", "helpful"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Lukas", "user_wrote_time": "Jun 2019", "contriNum": "9 contributions", "helpfulNum": "14 helpful votes", "currentRating": "3.0", "title": "Just okay", "content": "The hotel is situated in the lovely and quiet neighbourhood of Greenwich. It is indeed a very nice place, but dauntingly far from the city centre (30/40 mins with the subway, with usually 2/3 changes).  The room was okay, pretty small but with nice furniture, a comfortable bed and a decent bathroom.  The breakfast is served at the Café Rouge, directly attached to the hotel. Since it’s a café, it does not offer a buffet. What they serve is indeed very tasty, but it took us usually a lot of time before we could be served. For people who are only here for a short time, it is very inconvenient.  The staff is friendly and fast.  In total, pretty much okay. Would I pick it again? Only if I can’t find a solution which is closer to the centre.", "time": " June 2019", "helpful_vote": 1, "polarity": 0.199, "keywords": ["café", "breakfast", "tasty", "hotel", "buffet"], "matchKeywords": ["café", "breakfast", "tasty", "hotel", "buffet"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "kerryann337", "user_wrote_time": "Jun 2019", "contriNum": "33 contributions", "helpfulNum": "4 helpful votes", "currentRating": "3.0", "title": "Comic Con Break", "content": "Stayed at this hotel 2 years running now for MCM Comic Con, just a short walked from the DRL station. Very nice hotel, just abit of a rubbish view looking out, but that is the only downfall! Would stay again.", "time": " May 2019", "helpful_vote": 0, "polarity": 0.028, "keywords": ["hotel", "years", "downfall", "short", "comic"], "matchKeywords": ["hotel", "short"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Anthony N", "user_wrote_time": "Jun 2019", "contriNum": "18 contributions", "helpfulNum": "6 helpful votes", "currentRating": "5.0", "title": "One night stay", "content": "HI all, I stayed here on a Friday night due to having to be at Excel the following morning, Hotel room just a short walk from the DLR, close to some local shops and restaurants, Room was clean and tidy up on the second floor, only minor gripes was for me the toilet was very close to the wall and could only just sit down if needed being 6ft 1 and to close the curtains i had to climb over bed as table gave little room to get by.", "time": " May 2019", "helpful_vote": 0, "polarity": -0.896, "keywords": ["bed", "morning", "friday", "hotel", "toilet"], "matchKeywords": ["bed", "hotel", "toilet"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "WAZZA28", "user_wrote_time": "May 2019", "contriNum": "335 contributions", "helpfulNum": "141 helpful votes", "currentRating": "4.0", "title": "Good location in Greenwich", "content": "Fantastic location close to restaurants, hotels, The Cutty Shark, museums, shopping and the ferry terminal. Room was ordinary but very clean and staff were great, with a late afternoon checkout. The restaurant was very expensive, so we went to another one close by.", "time": " April 2019", "helpful_vote": 2, "polarity": 0.342, "keywords": ["restaurants", "restaurant", "checkout", "hotels", "expensive"], "matchKeywords": ["restaurants", "restaurant", "checkout", "hotels", "expensive"], "categories": ["facility", "service"], "userImg": "user-img.png"}, {"user_name": "jv2017414", "user_wrote_time": "May 2019", "contriNum": "6 contributions", "helpfulNum": "0", "currentRating": "4.0", "title": "Great place to visit London", "content": "Close to Greenwich station ( DLR, etc..). Very close to The Cutty Sark and in the center of Greenwich. Good value for an hotel ( room a little bit smaller than other Ibis but we were here to visit so..) Nice breakfast at the Café Rouge in the same premise as the Ibis. Our room ( 07 ) was very quiet, no nice view ( parking side ) but quiet.", "time": " May 2019", "helpful_vote": 0, "polarity": 0.438, "keywords": ["café", "breakfast", "hotel", "greenwich", "quiet"], "matchKeywords": ["café", "breakfast", "hotel", "greenwich", "quiet"], "categories": ["facility", "food", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "David G", "user_wrote_time": "May 2019", "contriNum": "22 contributions", "helpfulNum": "48 helpful votes", "currentRating": "2.0", "title": "Average ", "content": "although very clean rooms were too hot but no way to make them any cooler, The window faced into the central well of the hotel so no air flow if window was open any airflow was the kitchen extraction which was not pleasant, I was promised a fan 2nd day but never saw it, bed was not changed during a 4 night stay, should be changed every 2 days that is good hotel standard, reception staff very pleasant but not interested that the room was too hot or that I expected the bed linen to be changed after 2 days, ", "time": " May 2019", "helpful_vote": 2, "polarity": -0.914, "keywords": ["kitchen", "bed", "hotel", "cooler", "hot"], "matchKeywords": ["kitchen", "bed", "hotel", "hot"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "John W", "user_wrote_time": "May 2019", "contriNum": "145 contributions", "helpfulNum": "69 helpful votes", "currentRating": "4.0", "title": "Perfect location for site seeing in Greenwich", "content": "Offers comfortable enough, clean room and toilet/shower.   The adjoining restuarant was poor.   We went down the road to Bill's for breakfasts and dinner which was brilliant.   I would say Ibis do the job for providing good hostel type accommodation.   That's a bit unfair but pretty much what you would get in a hostel except the decor is better and bed comfy.   Would I choose Ibis over say Premier Inn or Holiday Inn   Doubt it but for Greenwich it has the perfect location.", "time": " May 2019", "helpful_vote": 1, "polarity": 0.264, "keywords": ["breakfasts", "dinner", "bed", "restuarant", "shower"], "matchKeywords": ["breakfasts", "dinner", "bed", "shower"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Adrian Straatman", "user_wrote_time": "May 2019", "contriNum": "58 contributions", "helpfulNum": "16 helpful votes", "currentRating": "3.0", "title": "Ibis Greewich", "content": "Room was extremly smal had to get in the bathroon one by one, beds were fine room was clean did what it said on the box , would I return, no not in a hurry.", "time": " May 2019", "helpful_vote": 0, "polarity": 0.117, "keywords": ["bathroon", "eastbourne", "beds", "pub", "room"], "matchKeywords": ["beds", "pub", "room"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Eatondave", "user_wrote_time": "May 2019", "contriNum": "130 contributions", "helpfulNum": "26 helpful votes", "currentRating": "4.0", "title": "Simple but perfect", "content": "Visited Greenwich for a weekend break and wanted a reasonably priced hotel close to everything. The Ibis ticks all the boxes. No frills but it's clean and comfortable. Special mention to the staff who are all friendly and efficient. I'd already checked in online and we were greeted and sorted in 5 minutes! Bed was really comfortable and the provision of the 'electric block' for plugs is genius. Also well done to the designer who actually put a plug socket under the mirror so my wife could see to dry her hair. Wish other hotels would take note.", "time": " May 2019", "helpful_vote": 0, "polarity": 0.265, "keywords": ["bed", "hotel", "wife", "hotels", "greenwich"], "matchKeywords": ["bed", "hotel", "wife", "hotels", "greenwich"], "categories": ["facility", "companion", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Concetta P", "user_wrote_time": "May 2019", "contriNum": "23 contributions", "helpfulNum": "4 helpful votes", "currentRating": "5.0", "title": "One night staying", "content": "I stayed at Ibis just one night however it was really a nice staying. The building and room are in modern style and also quite big. I didn't have a lot of luggage since my staying was for just one night. However, I'm sure there's enough room even with two or more bags.  It's located near the DLR station as well as pubs, restaurants and shops.", "time": " May 2019", "helpful_vote": 0, "polarity": 0.13, "keywords": ["restaurants", "night", "pubs", "modern", "shops"], "matchKeywords": ["restaurants", "pubs", "modern", "shops"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "MichelleB1989", "user_wrote_time": "May 2019", "contriNum": "186 contributions", "helpfulNum": "110 helpful votes", "currentRating": "4.0", "title": "Perfect for what we needed", "content": "My partner and I stayed here for a few nights after our wedding.  It was perfect for what we needed. Plenty of space in the bedroom.   If I had to moan about one thing was the view from our room was the car park. So it was often noisy.   Breakfast was nice, we didn't include it in the price but ate there on our last day.", "time": " May 2019", "helpful_vote": 0, "polarity": 0.148, "keywords": ["breakfast", "wedding", "nights", "bedroom", "car"], "matchKeywords": ["breakfast", "wedding", "bedroom", "car"], "categories": ["food", "facility", "travelling purpose"], "userImg": "user-img.png"}, {"user_name": "mmcnamee", "user_wrote_time": "May 2019", "contriNum": "274 contributions", "helpfulNum": "62 helpful votes", "currentRating": "4.0", "title": "Brilliant base when attending O2", "content": "I stayed here last night. We went to a concert at the O2. Travel from Greenwich pier to the O2 in 8 minutes!  The hotel location is perfect. Five mins from Cutty Sark and Greenwich park etc. Great choice of restaurants for lunch and dinner. The hotel was modern clean and well appointed. Small twin room, but perfect for what we needed.  Breakfast in Cafe Rouge was included and you could have anything on the menu. I had a full English and my friend had the pancakes.", "time": " May 2019", "helpful_vote": 1, "polarity": 0.629, "keywords": ["pancakes", "dinner", "breakfast", "lunch", "restaurants"], "matchKeywords": ["pancakes", "dinner", "breakfast", "lunch", "restaurants"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Seegal10", "user_wrote_time": "Apr 2019", "contriNum": "76 contributions", "helpfulNum": "48 helpful votes", "currentRating": "5.0", "title": "Perfectly placed hotel for running London marathon", "content": "I firstly selected this hotel purely on its location for getting to the start of the London Marathon which was absolutely ideal 👍 The staff were friendly and very helpful, hotel lovely and clean with adequate facilities. A little disappointed that when they say breakfast is included it is, in fact, with the cafe joined onto the hotel so I never managed breakfast on Marathon day as it was fully booked. No buffet style breakfast option here 😪 Thankfully I was prepared I brought porridge with me to have in the room 😅. Breakfast was great, don’t get me wrong, who wouldn’t love an English breakfast or pancakes with banana, bacon and maple syrup 🤤  Will definitely book here if I ever run the Marathon again, great little hotel with a modern design.", "time": " April 2019", "helpful_vote": 1, "polarity": 0.258, "keywords": ["pancakes", "bacon", "breakfast", "marathon", "porridge"], "matchKeywords": ["pancakes", "bacon", "breakfast"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "Cyra P", "user_wrote_time": "Apr 2019", "contriNum": "6 contributions", "helpfulNum": "5 helpful votes", "currentRating": "5.0", "title": "Outstanding customer service!", "content": "We arrived at Ibis Greenwich Sat 27 April to check in ahead of the London Marathon on the Sunday. They could not find our booking... only to realise we'd book for Monday 29th April and they were full! The Ass. Gen. Manager Vincenzo could not have been more helpful - calling other hotels to see if they could fit us in, and eventually finding us a room in the Ibis Greenwich - making the logistics and nerves of a marathon runner much calmer. A great example of customer service, which can be so rare these days.", "time": " April 2019", "helpful_vote": 0, "polarity": 0.402, "keywords": ["marathon", "sunday", "april", "monday", "29th"], "matchKeywords": [], "categories": ["others"], "userImg": "user-img.png"}, {"user_name": "-x-", "user_wrote_time": "Apr 2019", "contriNum": "43 contributions", "helpfulNum": "25 helpful votes", "currentRating": "1.0", "title": "SERIOUSLY ZERO IF THERE WAS AN OPTION", "content": "We booked the hotel a month ago to prepare for the London Marathon.   And when we arrived — after a 90 minute commute from Central London, the front desk told us that the room had been BRUTALLY CANCELLED BY THE MANAGEMENT. They said they have called in the afternoon, and when then they just decided they can take the room without our answer. Seriously, every single person knows there is NO BLOODY SIGNAL in the tube!   And they tried to hush us to the Novotel on the Isle of Dogs, 20 minutes walk+DLR transit away from the starting place.  The hotel manager just left. LOL   ANY COLLEGE LEVEL STUDENT IN HOTEL MANAGING COULD HAVE DONE MUCH BETTER.  ZERO! MINUS points down to the Thames.  No more ibis or Accor for me.   Goodbye. Good luck in your future business.", "time": " April 2019", "helpful_vote": 3, "polarity": -0.761, "keywords": ["marathon", "cancelled", "london", "afternoon", "manager"], "matchKeywords": ["london", "manager"], "categories": ["loation & surroundings", "service"], "userImg": "user-img.png"}, {"user_name": "Scenic19191048943", "user_wrote_time": "Apr 2019", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "3.0", "title": "Good w/end in Grenwich", "content": "Hotel very good and usual Ibis standard which was very good,but very disappointed with breakfast paid £9.95 but was only presented with standard breakfast or poached eggs on toast,not the usual choice of cold meats and various other choices maybe this can be addressed and have the standard that Ibis is famed for.", "time": " April 2019", "helpful_vote": 0, "polarity": -0.662, "keywords": ["breakfast", "eggs", "meats", "toast", "hotel"], "matchKeywords": ["breakfast", "eggs", "hotel"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Getaway28891795213", "user_wrote_time": "Apr 2019", "contriNum": "2 contributions", "helpfulNum": "0", "currentRating": "5.0", "title": "Ibis Greenwich", "content": "I’ve stayed here many times and it is always excellent. Friendly and helpful staff and located in the heart of Greenwich are ideal for my requirements. Cafe Rouge is adjacent to the hotel and the breakfast is excellent! I would definitely not hesitate in recommending it.", "time": " April 2019", "helpful_vote": 0, "polarity": 0.96, "keywords": ["breakfast", "cafe", "hotel", "ideal", "helpful"], "matchKeywords": ["breakfast", "cafe", "hotel", "ideal", "helpful"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "SeddyDevon", "user_wrote_time": "Mar 2019", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "2.0", "title": "Hidden charges", "content": "The hotel was basic but clean, which was fine for what we needed. I given a low score because we were hit with an extra charge for parking our car when we arrived. This is not made very clear when you initially book and pay for the hotel room. When I questioned having to pay extra for parking the receptionist replied \"Well, we don't normally get complaints about the extra charge\". Staff were pleasant but not particularly helpful if you had a problem.", "time": " March 2019", "helpful_vote": 0, "polarity": -0.478, "keywords": ["receptionist", "car", "parking", "hotel", "helpful"], "matchKeywords": ["receptionist", "car", "parking", "hotel", "helpful"], "categories": ["service", "facility"], "userImg": "user-img.png"}, {"user_name": "Thesqueakyflipflop", "user_wrote_time": "Mar 2019", "contriNum": "64 contributions", "helpfulNum": "27 helpful votes", "currentRating": "1.0", "title": "Appalling from start to finish", "content": "Appalling rude staff from the off. Awful experience! Don’t bother! Couldn’t get directions to even get to the hotel from the staff.", "time": " March 2019", "helpful_vote": 0, "polarity": -0.929, "keywords": ["rude", "disgraceful", "awful", "appalling", "cancellable"], "matchKeywords": ["rude", "awful"], "categories": [], "userImg": "user-img.png"}, {"user_name": "boydb588", "user_wrote_time": "Mar 2019", "contriNum": "15 contributions", "helpfulNum": "18 helpful votes", "currentRating": "4.0", "title": "good work", "content": "Your staff were excellent and the room was comfy, i would have extended my stay but the rate quoted was way more then i had been paying.", "time": " February 2019", "helpful_vote": 2, "polarity": 0.353, "keywords": ["comfy", "gladly", "extended", "paying", "stay"], "matchKeywords": ["comfy"], "categories": [], "userImg": "user-img.png"}, {"user_name": "Steve S", "user_wrote_time": "Mar 2019", "contriNum": "7 contributions", "helpfulNum": "1 helpful vote", "currentRating": "3.0", "title": "Hotel was clean, but.....", "content": "Once we booked our one night stay on 4th March 2019. We were inundated with emails and offers.   I was asked to check in online, which I did. I was asked for my time of arrival which I gave as around noon. This was all accepted online, having to give card details and my date of birth etc.  When we arrived, we were told there was a surcharge of £10 for early arrival. This was not mentioned when checking in online.  The staff were more interested in their phones and computers than they were at communicating with the guests.  Location was on the edge of the centre of Greenwich so was ok. Parking spaces are very tight.  The road noise was high, also train track across was noisy when trains sounded klaxon.", "time": " February 2019", "helpful_vote": 0, "polarity": -0.397, "keywords": ["online", "emails", "noon", "night", "2019"], "matchKeywords": ["online"], "categories": ["service"], "userImg": "user-img.png"}, {"user_name": "RayeLancs", "user_wrote_time": "Mar 2019", "contriNum": "169 contributions", "helpfulNum": "38 helpful votes", "currentRating": "2.0", "title": "Fair", "content": "Clean but small. Neatly tucked away but rather noisy due to thin walls. Interesting dangling lamps. Chic! Towels smelled of bleach. New lobby and bar concept will take getting used to. Breakfast is in Cafe Rouge which is nice as there's table service.", "time": " March 2019", "helpful_vote": 0, "polarity": 0.012, "keywords": ["breakfast", "cafe", "towels", "lobby", "bleach"], "matchKeywords": ["breakfast", "cafe", "towels", "lobby"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "ErmintrudeMook", "user_wrote_time": "Mar 2019", "contriNum": "51 contributions", "helpfulNum": "49 helpful votes", "currentRating": "2.0", "title": "Lovely location but basic...", "content": "Hotel is in a great location in beautiful Greenwich, ten minutes away from the sterility of Canary Wharf and Stratford. Lots of places to see, the Observatory and Naval Museum are superb and the views across London from the Hill are wonderful.   But I found the hotel poor for the price (£180 for a very basic room). Reception doubles as a bar, the staff were disinterested and fairly unhelpful- I asked for a quiet room but given room over the main road. It’s not busy by London standards but even so. Room ok but very basic - I’ve stayed in lots of London hotels and this wasn’t worth much.   Hotel is adjoining a Cafe Rouge for breakfast. Again, disappointed. Other tables served faster, it’s obviously not geared for business travel - food unremarkable and long wait.", "time": " January 2019", "helpful_vote": 1, "polarity": -0.188, "keywords": ["hotel", "cafe", "london", "hotels", "breakfast"], "matchKeywords": ["hotel", "cafe", "london", "hotels", "breakfast"], "categories": ["facility", "food", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Alex H", "user_wrote_time": "Feb 2019", "contriNum": "1 contribution", "helpfulNum": "1 helpful vote", "currentRating": "5.0", "title": "Fab hotel in central London", "content": "Excellent location with car parking and renovated rooms. Staff were welcoming; breakfast was plentiful. plenty of restaurants nearby to dine in; and nice area if you just want to have a walk in the evening .", "time": " February 2019", "helpful_vote": 1, "polarity": 0.999, "keywords": ["breakfast", "restaurants", "plentiful", "dine", "welcoming"], "matchKeywords": ["breakfast", "restaurants", "plentiful", "welcoming"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "GARY_STWART", "user_wrote_time": "Feb 2019", "contriNum": "48 contributions", "helpfulNum": "30 helpful votes", "currentRating": "5.0", "title": "City break", "content": "Stayed in a few of the ibis hotels, this one is any different. The staff are really friendly,helpful and serve with a smile. Hotel is very clean so are the rooms didnt expect anything less. The hotel is close to restaurants and local pubs, the greenwich market is a must. The local street food is amazing and so much too choose from. Hotel is also close the greenwich pier where we got the boat tour down the thames to Westminste to do some more touristy stuff as it was our first time in london. Defo returning next time as we didnt have alot of time to squeeze so much stuff in only 2 days.", "time": " February 2019", "helpful_vote": 2, "polarity": 0.131, "keywords": ["touristy", "restaurants", "hotel", "hotels", "pubs"], "matchKeywords": ["restaurants", "hotel", "hotels", "pubs"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "MrsMuffin81", "user_wrote_time": "Feb 2019", "contriNum": "147 contributions", "helpfulNum": "52 helpful votes", "currentRating": "4.0", "title": "Great little budget hotel ", "content": "I stopped at this hotel with my mum when we visited London for a show at the O2. It was fantastic. The hotel is right in the heart of Greenwich Village, about 5 minutes walk from Cutty Sark DLR.  The reception area is clean and minimalistic. The same reception team seem to man both the reception desk and the bar, which can be a bit confusing when you walk in but they're really friendly and welcoming and give you lots of info.  The rooms are compact but contain everything you need for a short stay. The beds are incredibly comfy, I slept like a log even with a stinking cold. The bathroom is a bit tight for space. The toilet was in a little alcove behind the bathroom door. It's a clever use of space but a bit of a squeeze and not very east to manoeuvre at all.", "time": " February 2019", "helpful_vote": 1, "polarity": 0.04, "keywords": ["hotel", "bathroom", "london", "toilet", "comfy"], "matchKeywords": ["hotel", "bathroom", "london", "toilet", "comfy"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "kohlid", "user_wrote_time": "Feb 2019", "contriNum": "29 contributions", "helpfulNum": "4 helpful votes", "currentRating": "4.0", "title": "EXCELLENT BUDGET HOTEL", "content": "Our recent stay was as good as the earlier one. Changes have been made in the reception area making it informal and user friendly. The rooms have been redone with carpets and modular furniture. This gives more space and adds to convenience.The room heating , toilet and hot water supply are excellent. Area for improvement are the toiletries provided. The front office staff are as friendly and excellent as ever.", "time": " February 2019", "helpful_vote": 0, "polarity": 0.349, "keywords": ["toiletries", "toilet", "improvement", "convenience", "carpets"], "matchKeywords": ["toiletries", "toilet", "convenience", "carpets"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Katherine2", "user_wrote_time": "Feb 2019", "contriNum": "60 contributions", "helpfulNum": "36 helpful votes", "currentRating": "5.0", "title": "Great location to visit my daughter at Uni.  Great hotel. Very comfortable.", "content": "The bed was so comfy and I had a great time visiting my daughter, cruising the river on the Clipper boat, walking to Poplar under the river, visiting the Cutty Sark, mooching around the market and taking in a show \"up West\"  Great visit to London made better by this wonderful hotel. Even went French at the Café Rouge next door to the hotel.", "time": " February 2019", "helpful_vote": 0, "polarity": 0.412, "keywords": ["daughter", "hotel", "café", "comfy", "river"], "matchKeywords": ["daughter", "hotel", "café", "comfy"], "categories": ["facility", "companion"], "userImg": "user-img.png"}, {"user_name": "Nina846", "user_wrote_time": "Feb 2019", "contriNum": "25 contributions", "helpfulNum": "8 helpful votes", "currentRating": "3.0", "title": "A weekend break", "content": "We booked into The Ibis Greenwich for 2nights. Large carpark which cost £15 a night. The good points are it’s very central, clean, good security & the staff were very friendly. Cafe Rougue is attached to the hotel were we had a lovely breakfast & evening meal. The bad things the room (although we upgraded) was very small & the bathroom was very tiny plus the bathroom towels were very thin & there was no hand towel. The decor is very basic & it was a bit noisy in the. corridor @ night.", "time": " January 2019", "helpful_vote": 0, "polarity": 0.049, "keywords": ["bathroom", "cafe", "breakfast", "towels", "hotel"], "matchKeywords": ["bathroom", "cafe", "breakfast", "towels", "hotel"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Llondbol", "user_wrote_time": "Jan 2019", "contriNum": "69 contributions", "helpfulNum": "51 helpful votes", "currentRating": "5.0", "title": "Great!", "content": "Perfect location, clean, comfortable, welcoming, reasonable and I will definitely come back. It was my first time in an Ibis hotel and I was pleasantly surprised, not what I was expecting so now looking forward to the next time.", "time": " January 2019", "helpful_vote": 1, "polarity": 0.994, "keywords": ["hotel", "pleasantly", "welcoming", "perfect", "clean"], "matchKeywords": ["hotel", "pleasantly", "welcoming", "perfect", "clean"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Richard H", "user_wrote_time": "Jan 2019", "contriNum": "29 contributions", "helpfulNum": "5 helpful votes", "currentRating": "4.0", "title": "Snow Patrol @ The O2", "content": "Excellent hotel, ideally situated. Close to railway station, Cutty Sark and just about walkable to O2 Arena. Breakfast, which was included in price, was next dooe at Cafe Royale, excellent food and good service. Will definately stay there again.", "time": " January 2019", "helpful_vote": 0, "polarity": 0.594, "keywords": ["breakfast", "cafe", "hotel", "food", "walkable"], "matchKeywords": ["breakfast", "cafe", "hotel", "food"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Freedom67406315231", "user_wrote_time": "Jan 2019", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "3.0", "title": "Great LOCation VERY GOOD: TRIP ADVISOR WOLD NOT ALLOW ME TO CLICK ON THIS!!! Very glitchy website", "content": "I recently stayed at the IBIS in Greenwich and was delighted with the LOCation of the hotel, close to City Airport, easy to get around on the DLR and most of all close to the Park, museum and Naval hospital. The room was fine, clean, good bed and adequate size but probably a bit tight for larger people. The staff at the hotel and in the adjoining cafe rouge were young, friendly and obliging. I will definitely return.  Website does not allow me to allocate 4 stars for some of the categories. Service; Value: location : should all be VERY GOOD and not average.", "time": " January 2019", "helpful_vote": 0, "polarity": 0.5, "keywords": ["hotel", "cafe", "hospital", "bed", "museum"], "matchKeywords": ["hotel", "cafe", "hospital", "bed"], "categories": ["facility", "food", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "ghettogpl", "user_wrote_time": "Jan 2019", "contriNum": "17 contributions", "helpfulNum": "0", "currentRating": "4.0", "title": "Nice stay", "content": "This hotel was a good choice. The room was clean and the bed comfortable. We had a problem because the air conditioner was not working but the staff solved this by giving us a heater. The staff was very nice and responsive.", "time": " December 2018", "helpful_vote": 0, "polarity": 0.547, "keywords": ["bed", "heater", "hotel", "comfortable", "clean"], "matchKeywords": ["bed", "hotel", "comfortable", "clean"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Ajei2000", "user_wrote_time": "Jan 2019", "contriNum": "155 contributions", "helpfulNum": "36 helpful votes", "currentRating": "4.0", "title": "Budget hotel in historic Greenwich area", "content": "The hotel is well located away from the hustle and bustle of central London but is close enough to allow for exploration of London. It is close to public transport  and very ideal is you are planning of visiting Canary Wharf, Olympic stadium or Stratford. The service is reasonable and the rooms clean. There are many restaurants around this area with a youngish feel to iit mainly from the students from Greenwich University across the Street.", "time": " January 2019", "helpful_vote": 0, "polarity": 0.649, "keywords": ["restaurants", "hotel", "london", "olympic", "clean"], "matchKeywords": ["restaurants", "hotel", "london", "clean"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Coastal31311201863", "user_wrote_time": "Jan 2019", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "5.0", "title": "comfort and good value", "content": "My wife and I stayed for three days. We often stay here as Greenwich is such an  interesting location. The adjacent Cafe Rouge is useful, especially for breakfast, but lunches etc as well. Rooms are quiet, beds very comfortable and the staff always helpful.", "time": " January 2019", "helpful_vote": 0, "polarity": 0.896, "keywords": ["lunches", "breakfast", "cafe", "wife", "beds"], "matchKeywords": ["breakfast", "cafe", "wife", "beds"], "categories": ["food", "companion", "facility"], "userImg": "user-img.png"}, {"user_name": "lyndacatherine", "user_wrote_time": "Jan 2019", "contriNum": "28 contributions", "helpfulNum": "9 helpful votes", "currentRating": "4.0", "title": "Great hotel.", "content": "The staff were very friendly and helpful.  The accommodation was good; the room and bathroom were clean, the bed was comfortable and there is a nice restaurant downstairs.  Well located, lots of shops, pubs and restaurants in the vicinity. I would definitely recommend.", "time": " December 2018", "helpful_vote": 0, "polarity": 0.998, "keywords": ["comfortable", "helpful", "clean", "restaurants", "restaurant"], "matchKeywords": ["comfortable", "helpful", "clean", "restaurants", "restaurant"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "4589712j", "user_wrote_time": "Dec 2018", "contriNum": "382 contributions", "helpfulNum": "84 helpful votes", "currentRating": "5.0", "title": "Great Location and friendly team", "content": "Very good Ibis hotel booked well in advance to get the best rate. Handy for the O2. Typical Ibis clean warm and very functual. Close to the river and tube station.", "time": " November 2018", "helpful_vote": 1, "polarity": 0.981, "keywords": ["warm", "functual", "hotel", "handy", "booked"], "matchKeywords": ["warm", "hotel", "handy", "booked"], "categories": ["facility", "service"], "userImg": "user-img.png"}, {"user_name": "Natasa1985", "user_wrote_time": "Dec 2018", "contriNum": "44 contributions", "helpfulNum": "3 helpful votes", "currentRating": "4.0", "title": "Great place to stay if your in Greenwich area! ", "content": "Stayed here for a short time before my European tour.", "time": " December 2018", "helpful_vote": 0, "polarity": 0.305, "keywords": ["london", "accommodation", "comfortable", "tour", "warm"], "matchKeywords": ["london", "comfortable", "warm"], "categories": ["loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Steven D", "user_wrote_time": "Dec 2018", "contriNum": "22 contributions", "helpfulNum": "9 helpful votes", "currentRating": "1.0", "title": "Too hard to book; too many hurdles", "content": "I tried desperately to book a room at this hotel for my parents. I won't explain the whole story, but I made four phone calls and booked, cancelled and booked again in order to complete this, but I just couldn't get Ibis/Accor to allow me to pay without my physical presence or a hand written note.   In the end I cancelled and booked at a different hotel.", "time": " December 2018", "helpful_vote": 0, "polarity": -0.961, "keywords": ["hotel", "parents", "cancelled", "desperately", "booked"], "matchKeywords": ["hotel", "booked"], "categories": ["facility", "service"], "userImg": "user-img.png"}, {"user_name": "Pete C", "user_wrote_time": "Dec 2018", "contriNum": "4 contributions", "helpfulNum": "1 helpful vote", "currentRating": "3.0", "title": "Cold room, dismal bathroom...", "content": "The hotel is perfectly situated for Greenwich with the DLR, buses, the river bus, all minutes away on foot. The staff are great, friendly and unstintingly helpful. Large, comfortable beds (as usual) meant that we slept well.   Our main gripes are that the rooms are cold, we had to use the supplied plug-in oil-filled heater heater (surely an admission of inadequate heating?), and the bathrooms are gloomy with inadequate lighting that means that you shower in a twilight zone. Oh, and first thing in the morning, hot water takes minutes to arrive at the shower and basin...   So, it's a bit of a mixed bag really with convenience and service just about trumping the negatives.", "time": " December 2018", "helpful_vote": 0, "polarity": -0.114, "keywords": ["shower", "bathrooms", "slept", "beds", "hotel"], "matchKeywords": ["shower", "bathrooms", "slept", "beds", "hotel"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "oziwarren", "user_wrote_time": "Dec 2018", "contriNum": "104 contributions", "helpfulNum": "41 helpful votes", "currentRating": "4.0", "title": "Great Location", "content": "The hotel is situated very near the historical precinct of Greenwich. The accommodation was clean and comfortable, but we had to change rooms after two days due to noisy plumbing. It was a pity that I could not have the restaurant meal charged back to the room. It appears the IBIS England has introduced a new check in procedure which has dispensed with the reception desk, and now the computer is balanced on a \"pub table\".....not very professional and a retrograde step as far as IBIS is concerned.", "time": " November 2018", "helpful_vote": 0, "polarity": -0.496, "keywords": ["plumbing", "restaurant", "pub", "hotel", "desk"], "matchKeywords": ["restaurant", "pub", "hotel", "desk"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Pioneer42612480896", "user_wrote_time": "Dec 2018", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "4.0", "title": "Great location - Friendly staff", "content": "We were visiting the o2 and the ibis was ideal as only a short bus ride away. Our room was clean and modern. We had 2 single beds the beds did seem a little narrow but comfortable. The only additions that would have been good would be a small fridge; maybe some bottled water and a bottle of milk instead of the little pods. Staff were friendly and helpful. There was limited parking on site at £15 a day charge. I would stay here again.", "time": " November 2018", "helpful_vote": 0, "polarity": -0.05, "keywords": ["fridge", "milk", "bus", "beds", "comfortable"], "matchKeywords": ["fridge", "milk", "bus", "beds", "comfortable"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Amanda H", "user_wrote_time": "Nov 2018", "contriNum": "188 contributions", "helpfulNum": "17 helpful votes", "currentRating": "4.0", "title": "Overnight stay for a visit to the O2", "content": "My husband and I have stayed here several times in the last 5-6 years as we find it so convenient for when we want to go to a show at the O2. Last weekend was another such occasion.  The hotel lobby has been revamped since our last visit so there is no longer a check-in desk; just a pedistal with a laptop. The lady that greeted us was polite and welcoming and check-in was a breeze. Our room on the second floor was rather compact but nicely decorated and had everything we needed for an overnight stay; a comfy bed, tv and a nice hot shower.  The only thing missing were some tea bags in the room; only coffee had been provided. All in all, we like this hotel, it is clean and good value for money plus perfectly positioned in the wonderful area of Greenwich.", "time": " November 2018", "helpful_vote": 0, "polarity": 0.265, "keywords": ["overnight", "tea", "hotel", "weekend", "shower"], "matchKeywords": ["tea", "hotel", "weekend", "shower"], "categories": ["facility", "food", "travelling purpose"], "userImg": "user-img.png"}, {"user_name": "TJMChippingCampden", "user_wrote_time": "Nov 2018", "contriNum": "992 contributions", "helpfulNum": "40 helpful votes", "currentRating": "4.0", "title": "A well located base for exploring Greenwich (and visiting the O2)", "content": "We use the Ibis Greenwich every time we are visiting the area and in particular when we have our annual trip to the ATP World Tennis finals at the O2 in November.  The rooms are \"compact\" (some would say \"bijou\" or minimalist), but frankly they are small but functional. The beds are comfy and so the room is ideal for what we needed, without paying silly prices for similar facilities at other more \"upmarket\" hotels in the area.  We don't use the Café Rouge which is attached to the hotel because frankly there are so many other better places in Greenwich for breakfast and, in fact all meals.", "time": " November 2018", "helpful_vote": 0, "polarity": -0.272, "keywords": ["atp", "tennis", "steak", "breakfast", "hotel"], "matchKeywords": ["breakfast", "hotel"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Timmy P", "user_wrote_time": "Nov 2018", "contriNum": "7 contributions", "helpfulNum": "0", "currentRating": "3.0", "title": "Ibis London Greenwich", "content": "Very clean hotel with friendly staff (particularly Logan on reception). I stay here on average 6 days per month. I'm really pleased that the ironing rooms have been reinstated, but I'd love it if the chairs provided in the rooms were more comfortable. I know that the hotel wants its guests to use the restaurant/bar, but sometimes I just want to sit in a comfy chair and watch the TV.....", "time": " November 2018", "helpful_vote": 0, "polarity": 0.166, "keywords": ["restaurant", "hotel", "comfy", "comfortable", "pleased"], "matchKeywords": ["restaurant", "hotel", "comfy", "comfortable", "pleased"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Sebastian U", "user_wrote_time": "Nov 2018", "contriNum": "6 contributions", "helpfulNum": "1 helpful vote", "currentRating": "4.0", "title": "Nice hotel in a good location", "content": "We`ve just had a very pleasant city break in London and Ibis Greenwich was our \"home\" for these few days. The hotel itself is located in a good part of London, being quite near the Observatory, Maritime Museum, Greenwich park and Cutty Sark. Of course there are many other sites to visit. We had a room on the 1st floor of the hotel. Do not be fulled, even if the hotel seems small from the outside it has about 80 rooms/floor, (1 and 2), so there was a bit of a journey from the elevator to the room :) It was a decent sized room, to be honest we didn`t need anything else from it. A TV with a quite a few channels, a drier, kettle so coat hangers and that`s about it.", "time": " November 2018", "helpful_vote": 0, "polarity": -0.043, "keywords": ["hotel", "london", "elevator", "museum", "greenwich"], "matchKeywords": ["hotel", "london", "elevator", "greenwich"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Ella S", "user_wrote_time": "Nov 2018", "contriNum": "27 contributions", "helpfulNum": "6 helpful votes", "currentRating": "5.0", "title": "Wonderful stay", "content": "I stayed there December 2017.  The Greenwich area is sort of magical in my eyes. The hotel was lovely, cosy and clean. The staff was nice. Check in was quick! One down side was that they were offering a menu but upon calling they said they have no food (we asked for pizza and they said no, we asked if they have anything else they said no), we were left hungry. I’d recommend if you don’t have food, have recommendations for open places during late evening hours for your guests.   Bed was very comfortable.", "time": " December 2017", "helpful_vote": 0, "polarity": 0.673, "keywords": ["pizza", "hungry", "menu", "hotel", "bed"], "matchKeywords": ["pizza", "menu", "hotel", "bed"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Maggie P", "user_wrote_time": "Nov 2018", "contriNum": "30 contributions", "helpfulNum": "15 helpful votes", "currentRating": "4.0", "title": "comfortable bed but noisy room", "content": "When we arrived the room was clean although basic. We thought the noise was from outside and tried to go to sleep hoping it would die down. We eventually realised that the banging was from the plumbing in the bathroom and it went on all night. We reported it the next morning and were told that maintenance would fix it. The noise was absent the next night then started again later. However I found that if \\I flushed the loo it disappeared. Quiet finally. Sorry that we had such an uncomfortable first night.", "time": " November 2018", "helpful_vote": 0, "polarity": -0.545, "keywords": ["sleep", "bathroom", "plumbing", "morning", "night"], "matchKeywords": ["sleep", "bathroom"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Simon B", "user_wrote_time": "Nov 2018", "contriNum": "204 contributions", "helpfulNum": "59 helpful votes", "currentRating": "2.0", "title": "Smell of damp towels", "content": "When I opened the door to my room I experienced the strong smell of damp towels for everyday of my 10 night stay, it took my breath away. (mine was the last room available when I checked in) I suspect this was due to very poor room ventilation, the vent in the bathroom is too small (or doesn’t work) & the window can only be opened a little because it’s restricted by a security lock and therefore the room cannot be aired sufficiently.", "time": " November 2018", "helpful_vote": 0, "polarity": -0.215, "keywords": ["shower", "bathroom", "towels", "damp", "leak"], "matchKeywords": ["shower", "bathroom", "towels", "damp"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "freethrow224", "user_wrote_time": "Nov 2018", "contriNum": "49 contributions", "helpfulNum": "32 helpful votes", "currentRating": "5.0", "title": "Excellent hotel in great location ", "content": "Couldn't fault my recent two night stay. Reception and booking in was great-efficient and friendly. Room was good, quirky, clean and spacious.   Cafe Rouge menu was good - and other local chain restaurants  very near by.   Would highly recommend.", "time": " November 2018", "helpful_vote": 1, "polarity": 0.846, "keywords": ["restaurants", "cafe", "menu", "efficient", "spacious"], "matchKeywords": ["restaurants", "cafe", "menu", "efficient", "spacious"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "MrAngry16", "user_wrote_time": "Nov 2018", "contriNum": "13 contributions", "helpfulNum": "4 helpful votes", "currentRating": "3.0", "title": "Convenient", "content": "This hotel is very convenient for the centre of town & close to all the Greenwich tourism areas. It’s a modern hotel with good size rooms and in a good area. The only draw back is the low key check in method which can take a while if they only have one member of staff doing this & serving the bar area as well! If you like this funky way of style then it’s all pretty cool.breakfast is provided in the restaurant adjacent but is expensive if your not a big eater! Anyway all in all a funky little hotel in the heart of Greenwich.", "time": " October 2018", "helpful_vote": 0, "polarity": 0.483, "keywords": ["restaurant", "hotel", "breakfast", "funky", "expensive"], "matchKeywords": ["restaurant", "hotel", "breakfast", "expensive"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Maureen M", "user_wrote_time": "Nov 2018", "contriNum": "61 contributions", "helpfulNum": "34 helpful votes", "currentRating": "4.0", "title": "Nice hotel", "content": "We stayed in the Ibis for two nights at the end of October, very quick check in with a very friendly girl to check us in, room was grand , bed very comfortable and I liked the pod type bathroom in a weird way, it’s a weird set up.  It was great to be able to get a drink when we got back to the hotel as all the bars close so early over in there compared to Ireland, even though it was a bit disappointing they had no gas to serve draught Heineken and no lemon for the gin and tonic.  We stupidly availed of breakfast in cafe rouge which is attached to the hotel and we were ripped off, it stated on the menu that it was £9.", "time": " October 2018", "helpful_vote": 0, "polarity": -0.032, "keywords": ["tea", "cafe", "bathroom", "breakfast", "hotel"], "matchKeywords": ["tea", "cafe", "bathroom", "breakfast", "hotel"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "ferelith", "user_wrote_time": "Nov 2018", "contriNum": "31 contributions", "helpfulNum": "22 helpful votes", "currentRating": "4.0", "title": "Cosy, quiet and well located", "content": "My friend and I booked a night here after a gig at the O2. It's convenient (about 20 mins on public transport) and located in the heart of charming Greenwich, which has loads of places to eat, fascinating historic venues and great flea markets! Our room was small but comfy and we slept very well. Staff were friendly and responsive to our requests for extra coffee sachets, lost room key cards etc. Best of all, there is a table and chairs under shelter outside, for guests who want to have a cigarette. Good value for money and good service compared with other hotel chains.", "time": " October 2018", "helpful_vote": 0, "polarity": 0.84, "keywords": ["hotel", "coffee", "comfy", "gig", "night"], "matchKeywords": ["hotel", "coffee", "comfy"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Nick C", "user_wrote_time": "Nov 2018", "contriNum": "109 contributions", "helpfulNum": "31 helpful votes", "currentRating": "3.0", "title": "Okay for a cheapish stay", "content": "London hotels are never cheap. This one is fine for a reasonable stay. Clean and corporate with easy check in and a functional room. A good location in Greenwich but impersonal and soulless. None the less it's okay.", "time": " November 2018", "helpful_vote": 0, "polarity": 0.645, "keywords": ["london", "hotels", "cheap", "soulless", "corporate"], "matchKeywords": ["london", "hotels", "cheap"], "categories": ["loation & surroundings", "facility"], "userImg": "user-img.png"}, {"user_name": "@theRedun", "user_wrote_time": "Nov 2018", "contriNum": "6 contributions", "helpfulNum": "1 helpful vote", "currentRating": "4.0", "title": "Stayed her for a gig at the O2", "content": "This is s good location for the O2 and not as expensive as those near the Excel or Canary Wharf.Rooms are standard Ibis rooms, if you use Ibis regularly, you know what you get.We used the adjoining Cafe Rouge for evening meal, which was surprisingly good, although the service could have been a bit better.  Our room price also included breakfast, which was also at the Cafe Rough, it good, but could have done with a little more.  £1.50 extra for a couple of slices of avocado a bit steep.Getting to the O2 was easy, DLR to Heron Quays or Canary Wharf then a 5 minute walk to Canary Wharf underground and one stop to North Greenwich.", "time": " October 2018", "helpful_vote": 0, "polarity": -0.141, "keywords": ["avocado", "breakfast", "cafe", "meal", "expensive"], "matchKeywords": ["breakfast", "cafe", "meal", "expensive"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "Lars W", "user_wrote_time": "Oct 2018", "contriNum": "49 contributions", "helpfulNum": "15 helpful votes", "currentRating": "3.0", "title": "Tiny reception ", "content": "Wasn’t really sure where the reception was. One person with a wee iPad and no desk seems unprofessional. I wouldn’t want to work there...   Cafe Rouge in the lobby can’t be beat, but you can’t charge your meals to your room. Not very integrated service.", "time": " October 2018", "helpful_vote": 0, "polarity": -0.997, "keywords": ["ipad", "cafe", "lobby", "unprofessional", "desk"], "matchKeywords": ["cafe", "lobby", "desk"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Gizem N", "user_wrote_time": "Oct 2018", "contriNum": "5 contributions", "helpfulNum": "3 helpful votes", "currentRating": "4.0", "title": "staying at Ibis", "content": "It's good to be near the University of Greenwich, good for student parents. You can access to Central London about an hour via DLR and underground. Good do have Cafe Rouge as a hotel restaurant. Also you have good wifi and computers in the reception.", "time": " September 2018", "helpful_vote": 0, "polarity": 0.636, "keywords": ["cafe", "wifi", "restaurant", "hotel", "london"], "matchKeywords": ["cafe", "wifi", "restaurant", "hotel", "london"], "categories": ["facility", "food", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "VickyNenya", "user_wrote_time": "Oct 2018", "contriNum": "75 contributions", "helpfulNum": "26 helpful votes", "currentRating": "3.0", "title": "OK for one night if going to the O2", "content": "The staff were very friendly but were not dressed in the way I would expect from this type of hotel; they were wearing t-shirts and leggings, which didn't look very professional.  The room was OK, but overpriced as it was quite basic.  The Cafe Rouge isn't that great either; no-one wants a croissant served on a piece of wood.  The location is very good though for the O2 and you can explore Greenwich easily from there.  It's only a five-minute walk from the DLR.  So, if it's just somewhere to rest your head for one night, it's fine, but I wouldn't want to stay longer.", "time": " October 2018", "helpful_vote": 2, "polarity": -0.593, "keywords": ["cafe", "overpriced", "hotel", "croissant", "night"], "matchKeywords": ["cafe", "overpriced", "hotel"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Yakamatutsi", "user_wrote_time": "Oct 2018", "contriNum": "66 contributions", "helpfulNum": "56 helpful votes", "currentRating": "4.0", "title": "One night stay for ELO Gig", "content": "We stayed at the Ibis in Greenwich for one night while visiting the O2 to see the ELO gig. The hotel is clean, the staff efficient & friendly & the hotel is in a very good location for the Greenwich areas. reasonable parking charges as well. The room we had was classed as \"superior\" I'd hate to see the size of the standard room if our's was superior. The room apart from being a little small was comfortable & quite & was clean. The restaurant for breakfast was good with friendly staff, it is based on the French theme. We ate at the Rivington 90 yards around the corner for our evening before meal. We would stay again if we are in the area again.", "time": " October 2018", "helpful_vote": 1, "polarity": 0.376, "keywords": ["restaurant", "hotel", "breakfast", "meal", "efficient"], "matchKeywords": ["restaurant", "hotel", "breakfast", "meal", "efficient"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Rosss1989", "user_wrote_time": "Oct 2018", "contriNum": "35 contributions", "helpfulNum": "12 helpful votes", "currentRating": "4.0", "title": "o2 Friday Night Stay", "content": "I stayed here with my partner as we were booked to see a show at the o2 just down the road.  In terms of convenience for the o2, it was great, only a 10 minute taxi ride away and also only a 10 minute walk from Greenwich train station. We were originally given a disabled twin room, it felt quite baron, no nice touches in there so we asked to be moved to a more suitable double for a couple.  Hotel staff instantly gave us a new room, and although small had a much nicer feel to it.  Overall, for the price paid it was a good nights stay.", "time": " October 2018", "helpful_vote": 0, "polarity": -0.109, "keywords": ["hotel", "taxi", "booked", "nights", "train"], "matchKeywords": ["hotel", "taxi", "booked", "train"], "categories": ["facility", "service", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "mm4356", "user_wrote_time": "Oct 2018", "contriNum": "20 contributions", "helpfulNum": "4 helpful votes", "currentRating": "2.0", "title": "Weekend visit", "content": "Noisy and smelly room right under ventilation system, we asked for a quiet room prior to arrival.  Staff friendly and helpful but wouldn't stay again. Breakfast in cafe rouge was lukewarm and over priced.", "time": " October 2018", "helpful_vote": 1, "polarity": -0.822, "keywords": ["breakfast", "cafe", "smelly", "lukewarm", "noisy"], "matchKeywords": ["breakfast", "cafe", "noisy"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "adj7317", "user_wrote_time": "Oct 2018", "contriNum": "161 contributions", "helpfulNum": "34 helpful votes", "currentRating": "4.0", "title": "Cool property, good location", "content": "I usually do not start with the negative, but it is the reason for the 4 instead of 5 rating and the check-in process. I made my reservation several months ago, and specifically picked this location, because I was offered the opportunity to pay a little extra to have an early check-in. This is brilliant, by the way, because of the early morning arrival to London. When I arrived to property, I informed the staff member that I was there to check in. Her first response was that there were no rooms available. After explaining that I had the ability to check in after 9 a.m. and showing her the confirmation a few times, she somehow found an available room. This kind of irritated, not only because of the long flight there, but because it was a blatant lie.", "time": " October 2018", "helpful_vote": 1, "polarity": -0.47, "keywords": ["morning", "london", "months", "early", "arrival"], "matchKeywords": ["london"], "categories": ["loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Ian W", "user_wrote_time": "Oct 2018", "contriNum": "77 contributions", "helpfulNum": "18 helpful votes", "currentRating": "4.0", "title": "Good short stay for the O2", "content": "This hotel is a convenient location for sightseeing around Greenwich and also visiting the O2. The rooms are basic but clean, functional and not cramped. The staff were all friendly and food is available at the adjoined Cafe Rouge. Greenwich Market, the Royal Observatory, the Cutty Sark and Greenwich College (the Painted Hall is closed until March 2019) are all within easy walking distance. Travel to the O2 by water taxi, underground or taxi is all straightforward. I would stay here again.", "time": " October 2018", "helpful_vote": 0, "polarity": 0.8, "keywords": ["cafe", "sightseeing", "clean", "hotel", "easy"], "matchKeywords": ["cafe", "sightseeing", "clean", "hotel", "easy"], "categories": ["food", "loation & surroundings", "facility"], "userImg": "user-img.png"}, {"user_name": "Cherryberry59", "user_wrote_time": "Oct 2018", "contriNum": "30 contributions", "helpfulNum": "15 helpful votes", "currentRating": "5.0", "title": "Seeing ELO at the 02", "content": "Stayed at the Ibis for one night as we had tickets to see ELO at the 02, the Ibis was an a good location with the tube just around the corner, or even a boat from the Cutty Sark with the first stop Tower Bridge. The staff at the Ibis were very helpful and friendly, rooms good with a comfy bed, room also had a window that I didn’t have to pay extra for and you could even open.  We got back to the hotel after seeing ELO at about 12.", "time": " October 2018", "helpful_vote": 0, "polarity": 0.279, "keywords": ["pizza", "hotel", "comfy", "bed", "night"], "matchKeywords": ["pizza", "hotel", "comfy", "bed"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "msboom", "user_wrote_time": "Oct 2018", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "3.0", "title": "Great, if you get the newly refurbished rooms", "content": "The location of this hotel is great, Greenwich is lovely and with the DLR you are well connected to the city. I've stayed at this hotel before and always had a newly refurbished room, which are lovely. Good value for money. This time, I got an \"old\" room. The towels were paper thin and smelled. As did the bed linen. Nothing worse than waking up, smelling like sour bed sheets, take a shower and still smell because the towels smell the same. Not impressed and an unnecessary boo boo in my book.", "time": " October 2018", "helpful_vote": 0, "polarity": 0.071, "keywords": ["towels", "shower", "bed", "hotel", "refurbished"], "matchKeywords": ["towels", "shower", "bed", "hotel"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "johles", "user_wrote_time": "Oct 2018", "contriNum": "38 contributions", "helpfulNum": "19 helpful votes", "currentRating": "3.0", "title": "Well placed Hotel", "content": "I arrived at the hotel a little early for check in and was quoted an extra £10 per room, this was with less than an hour left before the actual check in time, I thought this was a bit excessive Other than that there was nothing else I would fault. The staff were all friendly, rooms were clean and beds were comfortable.", "time": " October 2018", "helpful_vote": 0, "polarity": 0.016, "keywords": ["hotel", "hour", "beds", "early", "excessive"], "matchKeywords": ["hotel", "beds"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Gareth D", "user_wrote_time": "Oct 2018", "contriNum": "16 contributions", "helpfulNum": "14 helpful votes", "currentRating": "5.0", "title": "Excellent one-night stay.", "content": "We booked this hotel due to its convenient location as we were attending a show at the O2.  Situated in the centre of Greenwich, the hotel is just a two minute walk to the Cutty Sark and onto the river boat which takes you up to the O2.  Parking is just round the back of the hotel and at £15 per day isn't unreasonable.  The room was compact, but perfectly adequate for our needs with a big wet room that contained the toilet and shower.  The staff very attentive and friendly with the check-in and out process smooth and efficient.  We would recommend this hotel if you're attending the O2 and need a base to stay or for just exploring the wonderful area of Greenwich.", "time": " October 2018", "helpful_vote": 0, "polarity": 0.246, "keywords": ["hotel", "shower", "toilet", "efficient", "river"], "matchKeywords": ["hotel", "shower", "toilet", "efficient"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "TeamR827", "user_wrote_time": "Oct 2018", "contriNum": "46 contributions", "helpfulNum": "14 helpful votes", "currentRating": "4.0", "title": "Lovely! ", "content": "We had a weekend in London to see Micheal McIntyre, this was close to the O2 and reasonable. Friendly staff, super clean, welcoming lobby and reception/ bar. Rooms were totally fine and a lovely big shower. For the money I’m not sure it can be beaten. Loads of parking (£15 per 24hrs) and cafe rouge attached for a super lush breakfast (£9.25 each) ..... not a bad word to say about it.", "time": " October 2018", "helpful_vote": 0, "polarity": 0.359, "keywords": ["breakfast", "shower", "weekend", "lobby", "london"], "matchKeywords": ["breakfast", "shower", "weekend", "lobby", "london"], "categories": ["facility", "food", "travelling purpose", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Julie H", "user_wrote_time": "Oct 2018", "contriNum": "3 contributions", "helpfulNum": "2 helpful votes", "currentRating": "1.0", "title": "A total and utter disgrace ", "content": "I have just spent 90 minutes standing in this hotel reception and am currently in a mini cab being driven 70 miles because apparently the IBIS/Accor chain believes it is entirely appropriate to give away a pre-paid, pre-booked room of a single female traveller. When I turned up at this hotel at 10.30pm I was told that a family 'with a small child' had asked to stay on in the room that had been allocated to me and so they 'had to find me an alternative hotel'. The best that they managed was a hotel in Luton - conservatively 70 miles away. There are so many things wrong with what happened in this scenario that I struggle to know where to start- but let me try.", "time": " October 2018", "helpful_vote": 1, "polarity": -0.97, "keywords": ["30pm", "cab", "hotel", "70", "90"], "matchKeywords": ["cab", "hotel"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Tolga D", "user_wrote_time": "Sep 2018", "contriNum": "63 contributions", "helpfulNum": "20 helpful votes", "currentRating": "5.0", "title": "One of the best sleeps I've ever had ", "content": "The price I paid was reasonable, the room was spacious and cosy, my bed was also very comfortable I checked out early without having breakfast but I smelt fresh coffee somewhere and it smelt amazing will stay again and highly recommend ibis greenwich", "time": " May 2018", "helpful_vote": 0, "polarity": 0.717, "keywords": ["coffee", "breakfast", "comfortable", "spacious", "bed"], "matchKeywords": ["coffee", "breakfast", "comfortable", "spacious", "bed"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Adrian", "user_wrote_time": "Sep 2018", "contriNum": "16 contributions", "helpfulNum": "27 helpful votes", "currentRating": "4.0", "title": "decent place in the centre of greenwich", "content": "Had a one nighter as we were spending the evening in Greenwich and found this to be quite a pleasant place, staff were friendly and everything was nice and clean.", "time": " November 2017", "helpful_vote": 0, "polarity": 0.183, "keywords": ["breakfast", "evening", "nighter", "clean", "pleasant"], "matchKeywords": ["breakfast", "clean", "pleasant"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "Daytripper019", "user_wrote_time": "Sep 2018", "contriNum": "41 contributions", "helpfulNum": "6 helpful votes", "currentRating": "5.0", "title": "Very convenient place to stay.", "content": "Booked for a Sunday night because of it's location. Rooms very clean, comfortable and quiet. Breakfast at the Cafe Rouge next door. Lots to see and do around Greenwich including the market and Maritime Museum.", "time": " March 2018", "helpful_vote": 0, "polarity": 0.495, "keywords": ["breakfast", "cafe", "sunday", "comfortable", "museum"], "matchKeywords": ["breakfast", "cafe", "comfortable"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "TravelReviewer1983", "user_wrote_time": "Sep 2018", "contriNum": "5,206 contributions", "helpfulNum": "610 helpful votes", "currentRating": "3.0", "title": "Great location (PRICES INCLUDED)", "content": "Stayed here for 4 nights and paid £100 per night. Breakfast costs around £10 on top per person and is consumed at Cafe Rouge next door. The food there is average and below so go somewhere else for breakfast.  The hotel itself is perfectly located in the centre of Greenwich and is close to everything.   The rooms are okay but nothing special.   Staff were friendly.", "time": " September 2018", "helpful_vote": 1, "polarity": -0.292, "keywords": ["breakfast", "cafe", "hotel", "food", "nights"], "matchKeywords": ["breakfast", "cafe", "hotel", "food"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Purple31", "user_wrote_time": "Sep 2018", "contriNum": "115 contributions", "helpfulNum": "25 helpful votes", "currentRating": "3.0", "title": "Functional and location - that is it!", "content": "Hubby and I had an overtime stop in Greenwich so decided upon Ibis due to its location.   We were not disappointed in that regard. Perfect location for everything in Greenwich, ie. Cutty Sark, markets, Park, train station.  The room was small ... tiny. The  bed was uncomfortable and seemed to have an off thin mattress on a large base. The bathroom had its own challenges with a very oddly located toilet. Should you be tall you may struggle to just sit on the toilet.  Topping everything off the room was very warm and despite all attempts to reduce the temperature we remained quite warm during the evening.", "time": " September 2018", "helpful_vote": 0, "polarity": -0.18, "keywords": ["bathroom", "toilet", "mattress", "bed", "overtime"], "matchKeywords": ["bathroom", "toilet", "mattress", "bed"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "sharon g", "user_wrote_time": "Aug 2018", "contriNum": "8 contributions", "helpfulNum": "6 helpful votes", "currentRating": "5.0", "title": "Another great stay with ibis", "content": "We stayed here for two nights with two other couples, this is a lovely hotel very clean with great staff who were very helpful and even let us check in early. This was our first trip to Greenwich and it most definitely wont be our last!  We all really enjoyed our stay with you cant wait until next year.", "time": " August 2018", "helpful_vote": 0, "polarity": 0.403, "keywords": ["couples", "hotel", "nights", "gin", "greenwich"], "matchKeywords": ["hotel", "greenwich"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Ivan T.", "user_wrote_time": "Aug 2018", "contriNum": "232 contributions", "helpfulNum": "129 helpful votes", "currentRating": "4.0", "title": "Smart budgeting for a stay in London", "content": "This place is just great for anyone who has a business visit to any location sitting on DLR.  I stayed here for business, and I do not doubt to stay here again should go to London for a business trip.   The hotel is a classic 3* with comfortable rooms. What differentiates this particular Ibis from other hotels, even across its own AccorHotels chain is that the restaurant does not sere breakfast in a buffet format, but in a la carte format. It's an unusual experience to order breakfast to a waiter, but quite a pleasant one, and, I have to admit, prevents from overeating.   All in all I am very satisfied with my stay.", "time": " April 2018", "helpful_vote": 0, "polarity": 0.833, "keywords": ["waiter", "restaurant", "hotel", "hotels", "breakfast"], "matchKeywords": ["restaurant", "hotel", "hotels", "breakfast"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Keeley S", "user_wrote_time": "Aug 2018", "contriNum": "13 contributions", "helpfulNum": "6 helpful votes", "currentRating": "4.0", "title": "Great location for London", "content": "We have stayed at a few Ibis hotels, here and in Europe, this being a 3 star I was pleasantly surprised, we booked the suit room, room 203, the air con was on but didnt seem very effective, we had the window open also and the dull hum of the fans outside was pleasantly soothing, bought breakfast in with the room price expecting buffet like the others Ibis hotels we have stayed at but its actually at Cafe Rouge, a tip, save your money and walk 5 mins to the Weatherspoons, the toast was barely cooked, the bacon and sausage was overcooked, and when we asked for replacement bacon you could tell they really wasnt happy, you have to choose off the menu they give you and the juice was smaller than if you walked in off the street.", "time": " August 2018", "helpful_vote": 0, "polarity": -0.001, "keywords": ["bacon", "breakfast", "buffet", "cafe", "hotels"], "matchKeywords": ["bacon", "breakfast", "buffet", "cafe", "hotels"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Mwansa L", "user_wrote_time": "Aug 2018", "contriNum": "81 contributions", "helpfulNum": "5 helpful votes", "currentRating": "2.0", "title": "No frills, budget type of accommodation", "content": "Stayed here for a week with a family member. It is literally 3 star, you don't get anything more than what you pay for. Half way through our stay our air con stopped working (mind you it's summer time, hot, humid and the rooms are so tiny) the maintenance guy came in and gave us a small desk fan. No attempt was made to move us to another room. One day we had to go downstairs and ask for toilet paper and soap because the hotel did not restock our room after they had cleaned it. Also there is no hotel kitchen but there is a restaurant connected to it called Cafe Rouge and our experience there was equally disappointing. I wouldn't recommend this place if your looking for more attention to details and a bit more of an upmarket stay.", "time": " August 2018", "helpful_vote": 0, "polarity": -0.862, "keywords": ["summer", "toilet", "restaurant", "kitchen", "hotel"], "matchKeywords": ["toilet", "restaurant", "kitchen", "hotel"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "NorwichCrust", "user_wrote_time": "Aug 2018", "contriNum": "14 contributions", "helpfulNum": "11 helpful votes", "currentRating": "5.0", "title": "Modern Chic", "content": "Super service and spotlessly clean. I love this brand. Close to all amenities. Easy to drop into town also by tube. Highly recommended and staff are always on the mark. Loved the choice of pillows. A good night's sleep was made easier.", "time": " July 2018", "helpful_vote": 0, "polarity": 0.724, "keywords": ["love", "loved", "clean", "easy", "easier"], "matchKeywords": ["love", "loved", "clean", "easy"], "categories": [], "userImg": "user-img.png"}, {"user_name": "ajmcb1973", "user_wrote_time": "Aug 2018", "contriNum": "3 contributions", "helpfulNum": "0", "currentRating": "3.0", "title": "A nice hotel", "content": "This is a nice hotel at a reasonable price situated in a central position within Greenwich. You do however receive what you pay for.Firstly the room was not overly spacious though it as adequate. We were however only provided with 2 bathtowels but no hand towels for 2 people. We were given 3 pillows for 2 people which was odd. We did not have a bin in our room only a tiny one in the bathroom and we ran out of toilet roll. We were provided with more when we asked, but were disappointed to be caught short and have to ask!The breakfast was nice but I would not recommend buying in advance as we did as we did not always want a cooked breakfast and would have save £6 if we had paid on the day. Breakfast was nice though.", "time": " August 2018", "helpful_vote": 0, "polarity": -0.488, "keywords": ["bathtowels", "breakfast", "towels", "toilet", "bathroom"], "matchKeywords": ["breakfast", "towels", "toilet", "bathroom"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Michael L", "user_wrote_time": "Aug 2018", "contriNum": "431 contributions", "helpfulNum": "135 helpful votes", "currentRating": "3.0", "title": "Very much a no frills, functional and moderately priced hotel", "content": "We booked on line. Check in was straightforward and paid £15.00 to park the car. Rooms are smallish but adequate, clean and functional. An unexpected bonus was to have a kettle in the room for tea/coffee.", "time": " August 2018", "helpful_vote": 0, "polarity": -0.205, "keywords": ["tea", "coffee", "kettle", "car", "paid"], "matchKeywords": ["tea", "coffee", "kettle", "car"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "444Globehopper", "user_wrote_time": "Jul 2018", "contriNum": "26 contributions", "helpfulNum": "0", "currentRating": "5.0", "title": "Graduation celebration", "content": "Room was clean and comfortable, everything required for a good night, had an accessible room for parents, which they said was great. Only issue with standard room was toilet,bit of a tight fit against facing wall. Another fantastic part of this hotel is the adjoining Cafe Rouge, with a swing door to enter where an above average hotel breakfast and meals or coffees etc can be purchased. The hotel bar did not have our selection of beverages and the only beer on tap was out of stock, disappointing. Reception area was open plan and combined with bar, all part of the saving money via technology etc in our modern world. Generally would definitely recommend.", "time": " July 2018", "helpful_vote": 0, "polarity": 0.235, "keywords": ["toilet", "hotel", "cafe", "beer", "breakfast"], "matchKeywords": ["toilet", "hotel", "cafe", "beer", "breakfast"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "Topkoppite", "user_wrote_time": "Jul 2018", "contriNum": "1,954 contributions", "helpfulNum": "667 helpful votes", "currentRating": "3.0", "title": "Clean and functional", "content": "Stayed one night. Slow on Check-in (couldn't find my reservation) but eventually got a room on first floor at rear. Couldn't open window as there was a nearby extractor fan (and at 0700 the next morning a maintenance man accessed the roof to work on roof!) but air conditioning worked well. Bed was small but comfortable. Room was clean with decent level of lighting. Space for hanging clothes, bedside bench and desk with plastic chair. Bathroom adequate. Soaps on wall. Small hospitality tray. Check out easy.", "time": " July 2018", "helpful_vote": 0, "polarity": 0.006, "keywords": ["bed", "bathroom", "bedside", "morning", "soaps"], "matchKeywords": ["bed", "bathroom"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "banjo266", "user_wrote_time": "Jul 2018", "contriNum": "32 contributions", "helpfulNum": "20 helpful votes", "currentRating": "5.0", "title": "Room 134", "content": "Stayed  in a room on the main road this time.  Dbl glazing so no noise that impacted us.  Slight  variation in room lay out.  Not the pod as a bathroom,  fully tiled  etc,  have to say preferred the pod lay out,  more room on the toilet  etc.  Current  lay out bit tight  for 6ft tall aussie.  Once again,  pleasant check  in,  clean room and great pillows.", "time": " July 2018", "helpful_vote": 1, "polarity": 0.025, "keywords": ["toilet", "bathroom", "pillows", "tiled", "clean"], "matchKeywords": ["toilet", "bathroom", "pillows", "clean"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Jaquiwel", "user_wrote_time": "Jul 2018", "contriNum": "221 contributions", "helpfulNum": "77 helpful votes", "currentRating": "4.0", "title": "Great location", "content": "We stayed for one night on a good deal. We used the hotel car park. Our room was on the first floor above the entrance. No issues with noise, good blackout curtains. Room had air con. Very comfortable beds/pillows. Perfect location for a Greenwich stay.", "time": " July 2018", "helpful_vote": 0, "polarity": 0.374, "keywords": ["hotel", "beds", "pillows", "curtains", "car"], "matchKeywords": ["hotel", "beds", "pillows", "curtains", "car"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "UKRaj", "user_wrote_time": "Jul 2018", "contriNum": "199 contributions", "helpfulNum": "72 helpful votes", "currentRating": "3.0", "title": "comfortable, clean & tidy, but showing age and needs an update", "content": "comfortable, clean & tidy, but showing age and needs an update.  The hotel is well placed for exploring Greenwich.  Quite central and near to the railway and the river pier.  The rooms are not very bag but that is standard for London.  Decent basic budget hotel.", "time": " July 2018", "helpful_vote": 0, "polarity": 0.592, "keywords": ["hotel", "london", "comfortable", "greenwich", "tidy"], "matchKeywords": ["hotel", "london", "comfortable", "greenwich", "tidy"], "categories": ["loation & surroundings", "facility"], "userImg": "user-img.png"}, {"user_name": "Sandgrown2014", "user_wrote_time": "Jul 2018", "contriNum": "24 contributions", "helpfulNum": "24 helpful votes", "currentRating": "5.0", "title": "Great pre-cruise location", "content": "We enjoyed our 3 night stay prior to a cruise which left from Greenwich Pier - so close that we were able to easily wheel our suitcases down to the pier. Location is superb, so convenient for everything in Greenwich and beyond.  Transport links into London are superb.  We really enjoyed our stay here and would visit again. Yes, the rooms are small - and the bathroom is tiny - but everything was clean and the staff could not have been nicer.  Appreciated the air conditioning, as we stayed during a heatwave! The attached Café Rouge, with its outside terrace, was an ideal place for our final evening meal.", "time": " June 2018", "helpful_vote": 1, "polarity": 0.746, "keywords": ["café", "evening", "bathroom", "cruise", "meal"], "matchKeywords": ["café", "bathroom", "meal"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "GogsGraham", "user_wrote_time": "Jul 2018", "contriNum": "125 contributions", "helpfulNum": "53 helpful votes", "currentRating": "4.0", "title": "First Impressions", "content": "My first impression was a let down but this was caused by using Booking.com who messed the whole thing up. However the Hotel staff of David and Emma sorted everything and could not have been nicer. The rooms are small but clean and very modern  - we lasted 9 days without complaint once the booking was sorted. Breakfast is good and served in Cafe Rouge  part of the same building. WE found it great for being away from but near to the city if you wanted it. Big tip use the MBNA clippers to explore London as the tube is very poor now since they removed the ever so helpful staff. Both options are just a t minute walk from the hotel as are all things Greenwich, Observatory, Cutty Sark and Maritime Museum. O2 is just a 10 minute boat ride away  Noise outside is not too bad.", "time": " July 2018", "helpful_vote": 0, "polarity": 0.064, "keywords": ["breakfast", "cafe", "london", "hotel", "poor"], "matchKeywords": ["breakfast", "cafe", "london", "hotel", "poor"], "categories": ["food", "loation & surroundings", "facility"], "userImg": "user-img.png"}, {"user_name": "Martinsymons66", "user_wrote_time": "Jul 2018", "contriNum": "17 contributions", "helpfulNum": "9 helpful votes", "currentRating": "3.0", "title": "Il Divo Show", "content": "Great hotel and location. Good service but disappointed in the accessible room. If I had a large wheelchair I wouldn’t have got in the room.  Also the sink was too near the toilet. The shower was good.", "time": " July 2018", "helpful_vote": 1, "polarity": -0.125, "keywords": ["toilet", "shower", "wheelchair", "hotel", "sink"], "matchKeywords": ["toilet", "shower", "hotel", "sink"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Michael G", "user_wrote_time": "Jul 2018", "contriNum": "36 contributions", "helpfulNum": "2 helpful votes", "currentRating": "3.0", "title": "Good location but tiny rooms and baths", "content": "Best location if you’re boarding a cruise ship at Greenwich.  Young staff are friendly and helpful.  Very good restaurant for breakfast.  Room is tiny.  No room to open 2 suitcases.  Bathroom cramped for 1 person, let alone 2.  Room is best described as “spartan.", "time": " July 2018", "helpful_vote": 0, "polarity": -0.084, "keywords": ["restaurant", "spartan", "breakfast", "bathroom", "tiny"], "matchKeywords": ["restaurant", "breakfast", "bathroom", "tiny"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "mariomarkanders", "user_wrote_time": "Jul 2018", "contriNum": "126 contributions", "helpfulNum": "34 helpful votes", "currentRating": "4.0", "title": "Good location at a fair price", "content": "Lovely looking hotel from outside, nice from the inside too. relaxed atmosphere staff very helpful night and day. Rooms were very clean with all facilities though a little small, but for the price a very good deal.", "time": " June 2018", "helpful_vote": 0, "polarity": 0.937, "keywords": ["clean", "relaxed", "helpful", "hotel", "nice"], "matchKeywords": ["clean", "helpful", "hotel", "nice"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "StevieB", "user_wrote_time": "Jul 2018", "contriNum": "28 contributions", "helpfulNum": "7 helpful votes", "currentRating": "4.0", "title": "Great Hotel. Fantastic Location.", "content": "Stayed for one night on Thursday July 5th and hotel was lovely. Great location and lovely big room. Staff at reception not very welcoming and no hello how are you today which is a little disappointing being a Club Accor Member. Rooms very warm in summer but reception did give us a fan which was great. Having been out and returning late we wanted a bite to eat only to be told there is no food at all as they have run out. They could have mentioned this at reception. Bathroom was a little small but the power shower was fantastic and a good start to the day ahead. One more thing we left our bags at reception on check out so we could go and eat and when we returned we were handed the wrong bags!!! Not good for security. I would stay again and hopefully the welcome would be warmer.", "time": " July 2018", "helpful_vote": 0, "polarity": -0.072, "keywords": ["july", "thursday", "summer", "shower", "night"], "matchKeywords": ["shower"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Richard G", "user_wrote_time": "Jul 2018", "contriNum": "575 contributions", "helpfulNum": "202 helpful votes", "currentRating": "3.0", "title": "Funky Check-in", "content": "Well there is a stool rather than a desk, helpful enough, when there although my colleague had some trouble with the actual booking and payments, which took a while.  Luckily it was very handily located for us.   Rooms are standard Ibis, which is perfectly fine.  Mine was on the ground floor which turned out to be a bit noisy (from the bar) after midnight.  Prices seem to be pretty much par for the area which is not cheap.", "time": " July 2018", "helpful_vote": 0, "polarity": -0.122, "keywords": ["midnight", "cheap", "bar", "desk", "stool"], "matchKeywords": ["cheap", "bar", "desk"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "esboyce", "user_wrote_time": "Jul 2018", "contriNum": "3 contributions", "helpfulNum": "2 helpful votes", "currentRating": "5.0", "title": "Always a great place to stay", "content": "We've stayed here many times in over a decade and are always extremely happy. The location is perfect and a short walk to transport, museums, and all of Greenwich. The rooms are clean and well serviced, a bit small but workable for a week or two. An the restaurant has fantastic food and service.", "time": " June 2018", "helpful_vote": 0, "polarity": 0.979, "keywords": ["happy", "workable", "restaurant", "perfect", "clean"], "matchKeywords": ["happy", "restaurant", "perfect", "clean"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Sophy4511", "user_wrote_time": "Jun 2018", "contriNum": "4 contributions", "helpfulNum": "4 helpful votes", "currentRating": "3.0", "title": "Noisy!", "content": "Lovely hotel, friendly staff, very clean. We were really happy up until 0615 in the morning when music started blaring from the bar area, then someone was hoovering outside our door at 0730, then what sounded to be like crates were getting dragged around in the hallway at 0750! Check out time is 1200 so why do you have to be woken up so early lol.", "time": " June 2018", "helpful_vote": 0, "polarity": -0.206, "keywords": ["morning", "hotel", "woken", "0730", "happy"], "matchKeywords": ["hotel", "happy"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Ian G", "user_wrote_time": "Jun 2018", "contriNum": "154 contributions", "helpfulNum": "58 helpful votes", "currentRating": "5.0", "title": "Great Overnight Stay", "content": "Just needed an overnight hotel to stay and this worked perfectly for us. Very welcoming and the room was exactly as per the booking site. We arrived early in the day and the reception were able to find a room that was ready for us immediately. We were very appreciative.", "time": " May 2018", "helpful_vote": 0, "polarity": 0.741, "keywords": ["overnight", "hotel", "immediately", "appreciative", "ready"], "matchKeywords": ["hotel"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "JamesK", "user_wrote_time": "Jun 2018", "contriNum": "16 contributions", "helpfulNum": "14 helpful votes", "currentRating": "4.0", "title": "Good", "content": "Stayed 3 nights while attending concerts at nearby o2 Arena. Location was good for this, got a good price by booking well in advance. Hotel itself was basic but fully functional, very clean and staff were good.", "time": " June 2018", "helpful_vote": 0, "polarity": 0.373, "keywords": ["concerts", "hotel", "arena", "nights", "clean"], "matchKeywords": ["hotel", "clean"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Chris H", "user_wrote_time": "Jun 2018", "contriNum": "186 contributions", "helpfulNum": "81 helpful votes", "currentRating": "4.0", "title": "Room #7", "content": "A very good and well suitiated hotel in Greenwich, ideal for anyone visitining Greenwich area and the o2.  The o2 is just a ferrys ride way and easy to get to from the hotel. Taxi from the o2 back to the hotel is around £14 inc tip.   The room was very clean and and had no issues.  We checked in online which saves a lot of waiting at receiption, they then have just to issue your room card.   It hotel has a small bar, but next door is a resturant, this is where the breakfast is served.", "time": " June 2018", "helpful_vote": 0, "polarity": -0.008, "keywords": ["hotel", "breakfast", "resturant", "clean", "online"], "matchKeywords": ["hotel", "breakfast", "clean", "online"], "categories": ["facility", "food", "service"], "userImg": "user-img.png"}, {"user_name": "Phil H", "user_wrote_time": "Jun 2018", "contriNum": "18 contributions", "helpfulNum": "4 helpful votes", "currentRating": "2.0", "title": "One night was enough ", "content": "Room small, couldn't swing a cat in the bathroom and air con didnt work at all. Too hot to sleep and opening the window had no effect apart from adding noise. The breakfast was poor. All in all for the money £200 a night not worth it.", "time": " June 2018", "helpful_vote": 0, "polarity": -0.997, "keywords": ["cat", "sleep", "breakfast", "poor", "bathroom"], "matchKeywords": ["sleep", "breakfast", "poor", "bathroom"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Karla R", "user_wrote_time": "Jun 2018", "contriNum": "141 contributions", "helpfulNum": "66 helpful votes", "currentRating": "4.0", "title": "Great location, nice staff, OK rooms", "content": "The Ibis Greenwich has an amazing location. Close to everything in Greenwich and easy to get into central London via train or water taxi. We paid for early check in and had no problem getting rooms.  Overall, our group had three rooms and all of them were fine. The bed was comfortable and the styling was Ibis.  The biggest complaint was the lack of A/C.  The temperature outside was cool but the rooms were very stuffy. Thankfully, we could open windows but that wasn’t adequate. Overall, the staff was friendly and helpful.  For the price, this is a good place to stay in Greenwich.", "time": " June 2018", "helpful_vote": 0, "polarity": 0.287, "keywords": ["bed", "london", "taxi", "comfortable", "helpful"], "matchKeywords": ["bed", "london", "taxi", "comfortable", "helpful"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "TJR100", "user_wrote_time": "Jun 2018", "contriNum": "7 contributions", "helpfulNum": "1 helpful vote", "currentRating": "4.0", "title": "O2 and Greenwich stay.", "content": "Good location for local bars, cafes and Cutty Sark. Great view over to city of London. Hotel had friendly staff, it was very clean. Cafe Rouge next door. All you need for a night away. Long walk to O2 but plenty of buses.  Would book again.", "time": " June 2018", "helpful_vote": 0, "polarity": 0.634, "keywords": ["cafe", "hotel", "cafes", "london", "clean"], "matchKeywords": ["cafe", "hotel", "cafes", "london", "clean"], "categories": ["facility", "food", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Fulltrack", "user_wrote_time": "Jun 2018", "contriNum": "4 contributions", "helpfulNum": "0", "currentRating": "2.0", "title": "Young dynamic super friendly but under achieving", "content": "The crew was fantastic but lacking some steering from management, with the exception of one, we could not get a smile from. The bar is very limited and seating was not always comfortable. Rooms are ok with the exception of the all in plastic bathrooms.", "time": " June 2018", "helpful_vote": 0, "polarity": -0.411, "keywords": ["restaurant", "bathrooms", "cuisine", "bar", "limited"], "matchKeywords": ["restaurant", "bathrooms", "bar"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Sergey G", "user_wrote_time": "Jun 2018", "contriNum": "2 contributions", "helpfulNum": "0", "currentRating": "4.0", "title": "Nice boutique hotel, but heater wasn't working in my room", "content": "I liked it, nothing like a boutique hotel charm. The room was cold since I was traveling in December, and unfortunately the heater was broken so I had the hotel staff provide floor heaters. I like the small bar downstairs as you can meet different travelers there and enjoy a cold one.", "time": " December 2017", "helpful_vote": 0, "polarity": 0.286, "keywords": ["hotel", "cold", "december", "downstairs", "bar"], "matchKeywords": ["hotel", "cold", "bar"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Travelling woman", "user_wrote_time": "Jun 2018", "contriNum": "9 contributions", "helpfulNum": "2 helpful votes", "currentRating": "3.0", "title": "Was ok", "content": "Very expensive for a 1 night stay parking is £15 to park on sight which as ok very tight to get in the spaces. Right in the centre location is great.  6 of us stayed all the rooms were ok nothing special.", "time": " September 2017", "helpful_vote": 0, "polarity": -0.118, "keywords": ["expensive", "night", "tight", "parking", "15"], "matchKeywords": ["expensive", "parking"], "categories": ["service"], "userImg": "user-img.png"}, {"user_name": "Peter1941", "user_wrote_time": "Jun 2018", "contriNum": "433 contributions", "helpfulNum": "153 helpful votes", "currentRating": "5.0", "title": "Visit to Greenwich", "content": "Had a four day reunion so decided to book here. So handy for the DLR, Cutty Sark and so many other sttractions. Warm welcome and straight to a very comfortable room. Good Wi fi and tea and coffee provided. Very quiet.", "time": " June 2018", "helpful_vote": 0, "polarity": -0.016, "keywords": ["tea", "coffee", "book", "comfortable", "reunion"], "matchKeywords": ["tea", "coffee", "comfortable"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "Mark R", "user_wrote_time": "Jun 2018", "contriNum": "1,032 contributions", "helpfulNum": "131 helpful votes", "currentRating": "4.0", "title": "Nice hotel well situated in Greenwich", "content": "A good example of an Ibis, as always the check-in a bit chaotic, and you have to insist to make sure that they find the reservation, or the payment details or whatever.  Very clean and modern decoration, small room with a big, comfortable bed  It’s been a while since I was last here, and I’ve been to quite a few other Ibises since, but I thought they had the typical bathroom “pod” here, but no it has a very nice shower plate, good shower with lots of hot water! (The toilet however is positioned a little strangely and you feel like a sardine while sitting down.  Breakfast in the Rouge café that connects to the hotel was very good, tasty food and fast and friendly service.", "time": " June 2018", "helpful_vote": 0, "polarity": 0.388, "keywords": ["shower", "bathroom", "toilet", "bed", "breakfast"], "matchKeywords": ["shower", "bathroom", "toilet", "bed", "breakfast"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "ultimatesi", "user_wrote_time": "May 2018", "contriNum": "568 contributions", "helpfulNum": "150 helpful votes", "currentRating": "3.0", "title": "Great location ", "content": "Great location, near to shops, restaurants and local train/DLR services  Room was clean, bed was comfortable and shower was good.", "time": " May 2018", "helpful_vote": 0, "polarity": 0.401, "keywords": ["coldest", "shower", "bed", "hotel", "restaurants"], "matchKeywords": ["shower", "bed", "hotel", "restaurants"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Geoffrey K", "user_wrote_time": "May 2018", "contriNum": "8 contributions", "helpfulNum": "5 helpful votes", "currentRating": "5.0", "title": "As good as ever", "content": "We often stay at the Greenwich IBIS. Friendly helpful staff, comfortable bed, reasonable pricing for London. We had a disabled room - safe wet room and plenty of grab rails. Main room has weird decor (several shades of grey plus a bit of literally bloody red) - not to our taste but you spend most of your time in a bedroom with your eyes closed....", "time": " May 2018", "helpful_vote": 0, "polarity": 0.251, "keywords": ["bed", "bedroom", "london", "room", "decor"], "matchKeywords": ["bed", "bedroom", "london", "room"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "JohnWully", "user_wrote_time": "May 2018", "contriNum": "236 contributions", "helpfulNum": "80 helpful votes", "currentRating": "4.0", "title": "great location - comfortable stay", "content": "stayed for a one night trip to a concert on the Cutty Sark. ideal spot only a few minutes walk from the venue, right across the road from Greenwich Market, 5 mins from the railway station and easy access for plenty of restaurants. Comfortable room  and friendly greeting.", "time": " May 2018", "helpful_vote": 0, "polarity": 0.426, "keywords": ["concert", "night", "restaurants", "trip", "minutes"], "matchKeywords": ["concert", "restaurants", "trip", "minutes"], "categories": ["loation & surroundings", "facility", "travelling purpose", "service"], "userImg": "user-img.png"}, {"user_name": "TimRArmstrong", "user_wrote_time": "May 2018", "contriNum": "14 contributions", "helpfulNum": "4 helpful votes", "currentRating": "4.0", "title": "Great no frills room", "content": "Great location for park, Naval College, National maritime Museum, Observatory, Cutty Sark and markets. Informal check-in, small but spotlessly clean room with comfortable bed. TV, hairdryer and kettle all working. Shower room very small and could have done with an extra towel or two, but for the money I couldn't fault it, really.", "time": " May 2018", "helpful_vote": 0, "polarity": 0.529, "keywords": ["bed", "shower", "hairdryer", "comfortable", "towel"], "matchKeywords": ["bed", "shower", "hairdryer", "comfortable"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Gavin F", "user_wrote_time": "May 2018", "contriNum": "91 contributions", "helpfulNum": "11 helpful votes", "currentRating": "3.0", "title": "Great for marathon , poor for air con !", "content": "Stayed here with my wife when I was running the marathon .  Fantastic location with only 10 - 15 minute walk to start area.  Good location for surrounding shops , Restauraunt’s etc although a struggle to get pasta close by ( only 1 x Restauraunt that sold pasta !!lol)  The hotel staff were pleasant and helpful  Room was small but clean  Shower was great and bed extremely comfortable .  The one thing that lets this hotel down is the lack of air conditioning .  In fairness to the staff , when we highlighted it , they said it was “ climate control” but they couldn’t do much .  The hotel management need to rectify this as having to sleep on top of the covers with the window open in this day is unacceptable .", "time": " April 2018", "helpful_vote": 0, "polarity": 0.03, "keywords": ["pasta", "marathon", "shower", "wife", "hotel"], "matchKeywords": ["shower", "wife", "hotel"], "categories": ["facility", "companion"], "userImg": "user-img.png"}, {"user_name": "Enrico", "user_wrote_time": "Apr 2018", "contriNum": "234 contributions", "helpfulNum": "71 helpful votes", "currentRating": "3.0", "title": "Place for a qucik stay", "content": "I was there for two nights as I had a seminar at the Greenwich University which is located in front of the Hotel. The reception was very minimalistic but quick and gentle.  The room had no wardrobes, beds were average but the bathroom was very large. I'd had preferred more towels thought. Everything went smooth.", "time": " April 2018", "helpful_vote": 0, "polarity": 0.324, "keywords": ["bathroom", "towels", "hotel", "beds", "seminar"], "matchKeywords": ["bathroom", "towels", "hotel", "beds"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Michaela E", "user_wrote_time": "Apr 2018", "contriNum": "499 contributions", "helpfulNum": "205 helpful votes", "currentRating": "2.0", "title": "Perfect location for London Marathon, but that's it, otherwise stay clear", "content": "I could write pages on this hotel but I really can’t be bothered, it is quite easily summed up.  £298 for 2 nights - the night before the London Marathon and the night after - is a joke.  I appreciate everywhere in London probably flexes prices based on demand marathon weekend, especially Greenwich, but please at least pretend you’re not fleecing us senseless and attempt to offer some semblance of customer service. Room was pokey with no bath, though never claimed a bath in fairness.  Room, and hotel in general however were baking hot, and have been on all 3 stays.  Air-con in the rooms was totally useless, and opening the window just invited in a load of chatter and shouting from a service yard directly below.", "time": " April 2018", "helpful_vote": 0, "polarity": -0.649, "keywords": ["marathon", "baking", "weekend", "hotel", "london"], "matchKeywords": ["weekend", "hotel", "london"], "categories": ["travelling purpose", "facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "Myrna W", "user_wrote_time": "Apr 2018", "contriNum": "49 contributions", "helpfulNum": "17 helpful votes", "currentRating": "4.0", "title": "Nice location", "content": "Nice clean room with good bed. Neat bathroom set up. Since we're getting older having the elevator was good as well as the restaurant attached. Hotel staff very helpful and up on all the latest technology. Location great to get to all the sites in Greenwich, Canary wharf or catch the Underground to London proper. Staying out in Greenwich is a reminder of what London was like in the 80's. Sure wish they had one more chair in the room. Certainly will consider when we go back in September.", "time": " February 2018", "helpful_vote": 0, "polarity": 0.516, "keywords": ["elevator", "hotel", "bed", "bathroom", "london"], "matchKeywords": ["elevator", "hotel", "bed", "bathroom", "london"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "woutvanoss", "user_wrote_time": "Apr 2018", "contriNum": "4 contributions", "helpfulNum": "2 helpful votes", "currentRating": "2.0", "title": "poor hospitality", "content": "This hotel has apparently decided that hospitality, service and class are concepts that do not appeal to the modern traveler. The reception desk is gone. Instead, staff in T-shirts hang around in the entrance area and use their phones to check you in. In general, they were kind and helpful, but it didn't work for me. For one thing, the situation is confusing. But more seriously, it plays down the fundamental distribution of the roles we play in the hotel business, namely that we pay for service. To receive the guests at a desk acknowledges that there is an asymmetry here, and hobnobbing with teenagers in T-shirts on a welcome mat may be fun, but it does not signal a particular awareness that the hotel takes its specific role in this transaction seriously.", "time": " October 2017", "helpful_vote": 0, "polarity": -0.729, "keywords": ["hotel", "business", "desk", "asymmetry", "hospitality"], "matchKeywords": ["hotel", "business", "desk", "hospitality"], "categories": ["facility", "travelling purpose"], "userImg": "user-img.png"}, {"user_name": "InnominateOne", "user_wrote_time": "Apr 2018", "contriNum": "7 contributions", "helpfulNum": "2 helpful votes", "currentRating": "5.0", "title": "A Good Choice", "content": "Lived-up to my usual good experience of Ibis hotels. Good quality no frills accommodation. Well located both for Greenwich and easy access to central London via DLR. Liked having breakfast in the associated Cafe Rouge next door. Will not hesitate to return.", "time": " February 2018", "helpful_vote": 0, "polarity": 0.587, "keywords": ["breakfast", "cafe", "hotels", "london", "accommodation"], "matchKeywords": ["breakfast", "cafe", "hotels", "london"], "categories": ["food", "facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "petewba", "user_wrote_time": "Apr 2018", "contriNum": "3 contributions", "helpfulNum": "0", "currentRating": "1.0", "title": "Early check in", "content": "Needed an early check in so I phoned this hotel whose website said for an extra £10 they can guarantee an early check in from 9am and the woman on the phone said the hotel cannot guarantee an early check in and I may have to wait until a room becomes available. They wanted me to pay before they could give me an answer. I don't think so. Accor hotels by the way if ur thinking about booking online. Idiots.", "time": " April 2018", "helpful_vote": 0, "polarity": -0.813, "keywords": ["online", "9am", "hotel", "website", "hotels"], "matchKeywords": ["online", "hotel", "hotels"], "categories": ["facility", "service"], "userImg": "user-img.png"}, {"user_name": "Piotr K", "user_wrote_time": "Apr 2018", "contriNum": "1 contribution", "helpfulNum": "0", "currentRating": "5.0", "title": "Great place", "content": "Had to go to London on a short notice. Really good location and excellent reception service. Straight from the entrance you are welcomed by a warm smile of the reception team.", "time": " April 2018", "helpful_vote": 0, "polarity": 0.681, "keywords": ["warm", "reception", "london", "welcomed", "smile"], "matchKeywords": ["warm", "reception", "london", "smile"], "categories": ["service", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "AnnieRobBushey", "user_wrote_time": "Apr 2018", "contriNum": "100 contributions", "helpfulNum": "11 helpful votes", "currentRating": "5.0", "title": "Great value London by the Thames", "content": "We stayed here for one night as it was very convenient for Greenwich, The Curry Sark, The Royal Navel Collage, The Royal Observatory It’s on the Thames and across the road from the Great Greenwich Market which is filled with lots of interesting stalls selling fabulous gifts and tasteful souvenirs of London.  Greenwich itself has an array of little boutiques and eating places and the lovely Greenwich Park. If you walk to the top there is an amazing view of the whole of London and the Thames snaking it’s way through the town. Highly recommended for everyone tourists and locals. Along the Thames itself there are some lovely Restaurants and pubs selling great food. The Ibis itself was lovely and clean the staff very helpful and friendly and the beds really comfortable.", "time": " March 2018", "helpful_vote": 0, "polarity": 0.868, "keywords": ["tourists", "restaurants", "tasteful", "pubs", "london"], "matchKeywords": ["restaurants", "pubs", "london"], "categories": ["facility", "loation & surroundings"], "userImg": "user-img.png"}, {"user_name": "JacsandDave", "user_wrote_time": "Mar 2018", "contriNum": "136 contributions", "helpfulNum": "40 helpful votes", "currentRating": "5.0", "title": "Ibis Hotel Greenwich", "content": "No fuss, online booking and check in. Clean cheap room for an overnight stay, bar still open for a night cap when we arrived back from the theatre. Car parking very reasonable with extension available at a good price too. Choices of transport into the city from local pier or bus stops also reasonably priced, quick and easy with contactless payment on board. All staff polite and helpful, thankyou we’ll be back.", "time": " March 2018", "helpful_vote": 0, "polarity": 0.367, "keywords": ["polite", "cheap", "easy", "clean", "overnight"], "matchKeywords": ["polite", "cheap", "easy", "clean"], "categories": [], "userImg": "user-img.png"}, {"user_name": "steve p", "user_wrote_time": "Mar 2018", "contriNum": "25 contributions", "helpfulNum": "13 helpful votes", "currentRating": "5.0", "title": "Hotel break in Greenwich London.", "content": "Very welcoming hotel,very pleasant and helpful staff,hotel was clean,room was well stocked and clean,breakfast is next door at Cafe Rouge but the entrance is inside the hotel,again here breakfast was fine and staff again were excellent. If you want to stay in Greenwich I would recommend this hotel,it is in the centre not to far from the Cutty Sark,DLR is close by with a range of pubs and restaurants to eat it is ideal.", "time": " March 2018", "helpful_vote": 0, "polarity": 0.987, "keywords": ["hotel", "cafe", "restaurants", "breakfast", "clean"], "matchKeywords": ["hotel", "cafe", "restaurants", "breakfast", "clean"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "pke71111", "user_wrote_time": "Mar 2018", "contriNum": "12 contributions", "helpfulNum": "0", "currentRating": "4.0", "title": "Paul ennis", "content": "Ideal location for greenwich.", "time": " March 2018", "helpful_vote": 0, "polarity": 0.969, "keywords": ["restaurants", "comfortable", "clean", "bed", "ideal"], "matchKeywords": ["restaurants", "comfortable", "clean", "bed", "ideal"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "roberteC4611HG", "user_wrote_time": "Mar 2018", "contriNum": "28 contributions", "helpfulNum": "8 helpful votes", "currentRating": "5.0", "title": "Good", "content": "Once again a good stay at this hotel. Most rooms are now upgraded to the new style. Friendly efficient staff. Saw a few people having difficulty, however, all of their own making.  Very good rate for parking (£15 a day). Right on the doorstep of London. 2 mins from the river bus and straight in to London.", "time": " March 2018", "helpful_vote": 0, "polarity": 0.688, "keywords": ["london", "hotel", "efficient", "upgraded", "new"], "matchKeywords": ["london", "hotel", "efficient", "upgraded", "new"], "categories": ["loation & surroundings", "facility"], "userImg": "user-img.png"}, {"user_name": "Shirley-7", "user_wrote_time": "Mar 2018", "contriNum": "230 contributions", "helpfulNum": "71 helpful votes", "currentRating": "5.0", "title": "Good ,Clean Hotel in great location", "content": "Our stay in this Hotel was to enable us to attend a nearby family funeral. Our request for a quiet room upper floor was granted with no problem. The room was standard Ibis type as was the bathroom - clean and efficient. I will say the towels were quite thin but did the job. Tea/coffee facilities and an ironing board/iron were provided. Breakfast was not the normal Ibis type - it was in the adjoining restaurant and although 'okay' if you wanted a cooked breakfast there wasn't the usual choice and just 1 hot drink in the price of £9.95. Car parking is £15 per night - remember to tell them at check in or you could receive a fine. Just a stones throw from the Thames path, Cutty Sark and Royal Naval College with plenty coffee/eating places around ( see separate reviews ).", "time": " March 2018", "helpful_vote": 0, "polarity": -0.014, "keywords": ["tea", "breakfast", "coffee", "restaurant", "bathroom"], "matchKeywords": ["tea", "breakfast", "coffee", "restaurant", "bathroom"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Rod A", "user_wrote_time": "Mar 2018", "contriNum": "53 contributions", "helpfulNum": "9 helpful votes", "currentRating": "5.0", "title": "Excellent Hotel in a very central location", "content": "Good clean economic hotel with cafe rouge next door for food. Will return to do more sightseeing in great location. Stayed 2 enjoyable nights. Shame dustmen empties bins around 4am but I suppose it needs to be done.", "time": " March 2018", "helpful_vote": 0, "polarity": 0.496, "keywords": ["cafe", "sightseeing", "hotel", "nights", "food"], "matchKeywords": ["cafe", "sightseeing", "hotel", "food"], "categories": ["food", "loation & surroundings", "facility"], "userImg": "user-img.png"}, {"user_name": "smoof2010", "user_wrote_time": "Feb 2018", "contriNum": "47 contributions", "helpfulNum": "13 helpful votes", "currentRating": "4.0", "title": "Basic but decent", "content": "Good basic hotel.  Room was of a decent size & clean enough.  No problems with any of the hotel staff – they all seemed to be polite & helpful.  The no desk check- in is one that I actually prefer as providing you check-in online, you can be in your room in a minute. Check-out was even faster, just drop your card off on the way out.  I had no problems with any sound issues & slept very well, although I did ask for a quiet room when booking.  I would have preferred a buffet breakfast as the choices on offer seemed to be on the small side for the price you pay (£10), whereas with a buffet you can eat as much as you want.  The hotel was easy enough to find, approx. 2 minutes’ walk from the Greenwich DLR station.", "time": " February 2018", "helpful_vote": 0, "polarity": 0.07, "keywords": ["polite", "breakfast", "buffet", "clean", "easy"], "matchKeywords": ["polite", "breakfast", "buffet", "clean", "easy"], "categories": ["food"], "userImg": "user-img.png"}, {"user_name": "NeilRV", "user_wrote_time": "Feb 2018", "contriNum": "113 contributions", "helpfulNum": "64 helpful votes", "currentRating": "2.0", "title": "Worse than before..", "content": "Selections of problems included:  Was easier to check in with a desk  The new bathroom design means you can’t sit on the loo (if you have legs)  Staff are particularly brusque and were really rude to my colleague because he had misunderstood some English - neither party were native English speakers.   Removal of car park barrier means you have to tell them you have parked or risk a fine. Although that’s not really clear. Have a damn barrier - you’re charging a fortune for parking!  The full English breakfast in the adjoining restaurant is not full. It’s about half a breakfast - the baked beans are served in  a pot about the size of a thimble. Toast is an extra £1:50.  Some rooms have doors connecting rooms which aren’t acoustically sound.", "time": " February 2018", "helpful_vote": 0, "polarity": -0.704, "keywords": ["rude", "breakfast", "beans", "restaurant", "bathroom"], "matchKeywords": ["rude", "breakfast", "restaurant", "bathroom"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Sazzle1976", "user_wrote_time": "Feb 2018", "contriNum": "488 contributions", "helpfulNum": "58 helpful votes", "currentRating": "3.0", "title": "Good location and price, basic rooms ", "content": "You get what you pay for! Rates here are extremely competitive and offer excellent value for money, but if it's home comforts you're after this isn't the hotel for you!   My understanding is that all rooms in this type of Ibis are the same. They are perfectly functional, our room was spacious and clean. We asked for a twin room, beds are very narrow but extremely comfy. It lacked amenities but you do get a wall mounted shower  gel and hand wash, also tea and coffee.   The location is great, everything in Greenwich is within 5-10 minutes walk. Staff were polite and reception was warm and welcoming.  Breakfast is served at the adjoining Cafe Rouge and offers excellent value, a good menu choice and friendly service.  All in all I really can't complain.", "time": " February 2018", "helpful_vote": 0, "polarity": 0.542, "keywords": ["tea", "shower", "hotel", "warm", "polite"], "matchKeywords": ["tea", "shower", "hotel", "warm", "polite"], "categories": ["facility", "food"], "userImg": "user-img.png"}, {"user_name": "lancashirearab", "user_wrote_time": "Feb 2018", "contriNum": "30 contributions", "helpfulNum": "33 helpful votes", "currentRating": "2.0", "title": "Poor soundproofing ", "content": "Choose to Stay here for three nights as I’ve used ibis before and enjoyed my visit. However this ibis was of a different standard and didn’t provide a buffet breakfast, only access to a cafe Rouge next door for £9.25 each morning. There was several choices but none that catered for someone who doesn’t like a big breakfast.  The location was great. The room was clean and of an adequate size and the bed comfy but the soundproofing was poor. I was kept awake until after 12 by a telly on the NEXT corridor and woken 6am by it.", "time": " February 2018", "helpful_vote": 1, "polarity": -0.402, "keywords": ["breakfast", "buffet", "bed", "cafe", "morning"], "matchKeywords": ["breakfast", "buffet", "bed", "cafe"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "Michael C", "user_wrote_time": "Feb 2018", "contriNum": "25 contributions", "helpfulNum": "7 helpful votes", "currentRating": "4.0", "title": "Very friendly staff", "content": "My partner and I found this hotel very clean throughout and the staff were very helpful. Our room was nice and clean with a nice shower room. All in all, it was a pleasant stay at this hotel. It’s in an ideal spot of Greenwich London, a quick taxi ride to the 02 Arena and other places of interest. The restaurant next door serves up very nice food at reasonable prices for London.", "time": " December 2017", "helpful_vote": 0, "polarity": 0.814, "keywords": ["hotel", "shower", "clean", "restaurant", "pleasant"], "matchKeywords": ["hotel", "shower", "clean", "restaurant", "pleasant"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "perry h", "user_wrote_time": "Feb 2018", "contriNum": "226 contributions", "helpfulNum": "41 helpful votes", "currentRating": "4.0", "title": "Location, Location, Location - Excellent !", "content": "This Hotel enjoys a fantastic location, adjacent to the ''Greenwich Culture Hub'' - a hive of activity, where a truly cosmopolitan mix, of locals, tourists, students et al, fill the streets with colour and culture.  Shops, boutiques, bistros, restaurants, pubs, cafes and bars all vie for attention, just five minutes walk from superb historic buildings, architecture, historic landmarks, and of course the legendary River Thames, and all year round beautiful Greenwich park.  The Maritime Museum, Cutty Sark, Gypsy Moth ( To name but a few of the stellar attractions ) Are only 5 minutes walk from the Hotel, while the 02 Arena is just 5 minutes ride away by taxi.", "time": " January 2018", "helpful_vote": 0, "polarity": 0.499, "keywords": ["cosmopolitan", "bistros", "hotel", "tourists", "boutiques"], "matchKeywords": ["hotel"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Mark R", "user_wrote_time": "Feb 2018", "contriNum": "1,032 contributions", "helpfulNum": "131 helpful votes", "currentRating": "4.0", "title": "Nice hotel, but there always seem to be problems at check in", "content": "Nice hotel near the Greenwich Market  Simple rooms but clean and comfortable.  Breakfast in the Café Rouge alongside which is always good  The only complaint is that there always seem to be problems at check-in. This time they insisted for 10 minutes that the room had not been prepaid, and only as I stood my ground did they carry on checking till they found it.", "time": " February 2018", "helpful_vote": 0, "polarity": 0.24, "keywords": ["breakfast", "café", "hotel", "prepaid", "minutes"], "matchKeywords": ["breakfast", "café", "hotel", "minutes"], "categories": ["facility", "food", "service"], "userImg": "user-img.png"}, {"user_name": "W3637NVmichaelh", "user_wrote_time": "Feb 2018", "contriNum": "9 contributions", "helpfulNum": "3 helpful votes", "currentRating": "5.0", "title": "Very good and will stay again.", "content": "This was our second stay here and won't be the last, the hotel is very well presented, clean and modern with friendly efficient staff. The location is excellent for Greenwich, for the tourist trails and transport links, more than enough restaurants and bars within minutes walk.", "time": " January 2018", "helpful_vote": 0, "polarity": 0.99, "keywords": ["efficient", "hotel", "restaurants", "modern", "clean"], "matchKeywords": ["efficient", "hotel", "restaurants", "modern", "clean"], "categories": ["facility"], "userImg": "user-img.png"}, {"user_name": "Sunburst1111", "user_wrote_time": "Jan 2018", "contriNum": "408 contributions", "helpfulNum": "175 helpful votes", "currentRating": "4.0", "title": "Nice Hotel, good value and location", "content": "Got a good rate on the hotel, Arrival to the carpark which wasn't full, even the next morning so I imagine parking is not an issue.  It cost £15 for 24hrs, could have sworn I saw it advertised at £13 however.  Check in the usual quirky way, met at the door by a member of staff and a PDA. All was simple enough.  Got the invoiced emailed to me on check in, which is good. Avoids waiting on it the next morning and easy to drop key cards in box.  Lift was key card operated, my room was on the second floor.  Not much of a view (of some AC equipment).  Room is modern and clean. Medium sized room with a comfy bed.  The bath room is not a bad size, however the toilet is in the corner which left not a lot of room to manoeuvre.  TV with free view, a hair dryer and Tea/coffee available.", "time": " January 2018", "helpful_vote": 0, "polarity": -0.075, "keywords": ["coffee", "tea", "morning", "24hrs", "dryer"], "matchKeywords": ["coffee", "tea", "dryer"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "sarahgale2016", "user_wrote_time": "Jan 2018", "contriNum": "6 contributions", "helpfulNum": "3 helpful votes", "currentRating": "3.0", "title": "Very good but smelly", "content": "My husband and I stayed at the Greenwich Ibis this weekend.   The location is fantastic, the room was perfectly adequate.  We walked into the room and there was a dreadful smell, we weren’t sure what it was at all, but opened the window.  We came back very late at night and the smell was still terrible.  The next morning we mentioned this to the receptionist who offered us to move.   We were on our way out and had a very busy day planned as it was my husbands birthday, so we didn’t have time to go and pack out things back up.  I just asked if they could have a look and maybe spray some air freshener.   We returned late that night and it was just the same.  I spoke to a lady on our way to check out and she reported the same problem in her room also.", "time": " January 2018", "helpful_vote": 0, "polarity": -0.461, "keywords": ["birthday", "weekend", "husband", "morning", "husbands"], "matchKeywords": ["birthday", "weekend", "husband"], "categories": ["travelling purpose", "companion"], "userImg": "user-img.png"}, {"user_name": "Munki S", "user_wrote_time": "Jan 2018", "contriNum": "69 contributions", "helpfulNum": "14 helpful votes", "currentRating": "5.0", "title": "Christmas break away", "content": "From booking to checking out, everything about our trip was fab. The hotel had parking which felt secure and it was easy to check in and get to our room. Although basic, our double room had a comfy big bed and tea making facilities. The bathroom was like something you'd expect on a spaceship, but it was just right for what we needed! We didn't make use of the bar/cafe downstairs, but it always seemed busy and had a good atmosphere. The location was ideal and was close to both the DLR and the river taxi, so within minutes you find yourself at all the famous attractions without too much hassle. Greenwich itself is lovely.  Steeped in history and has it's own attractions to see.", "time": " December 2017", "helpful_vote": 0, "polarity": 0.719, "keywords": ["spaceship", "hotel", "tea", "comfy", "cafe"], "matchKeywords": ["hotel", "tea", "comfy", "cafe"], "categories": ["food", "facility"], "userImg": "user-img.png"}, {"user_name": "John C", "user_wrote_time": "Jan 2018", "contriNum": "97 contributions", "helpfulNum": "17 helpful votes", "currentRating": "3.0", "title": "Last time?", "content": "Coming here since 2007 this Year is Perhaps the last time. December 2016 we failed to come because my dad died just before boarding the plane in Amsterdam. We informed Ibis and they just said “you can’t cancell”. Not even Some Words of sympathy, but ok. This time arrived in the Evening and there was no counter, a young girl came upon us, sat down on a high table with a laptop and het I-phone. Just then we realised that was the counter. We checked in and the room was ok. For the next days we noticed a letter in the elevator telling the questions there would be a fire test that day ....... What day, iT still hangs there after 5 days.  Must say that most of the time there is nobody at the lounge for the guests.", "time": " January 2018", "helpful_vote": 0, "polarity": -0.535, "keywords": ["died", "iphone", "december", "elevator", "2007"], "matchKeywords": ["elevator"], "categories": ["facility"], "userImg": "user-img.png"}]}